{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import Libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "import os\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_groq import ChatGroq\n",
    "from langchain.chains import GraphCypherQAChain"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Load Secrets from .env"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\COMP\\ajai\\Github\\GraphRAG-Neo4j\\.venv\\Lib\\site-packages\\tqdm\\auto.py:21: TqdmWarning: IProgress not found. Please update jupyter and ipywidgets. See https://ipywidgets.readthedocs.io/en/stable/user_install.html\n",
      "  from .autonotebook import tqdm as notebook_tqdm\n"
     ]
    }
   ],
   "source": [
    "llm = ChatGoogleGenerativeAI(\n",
    "    model=\"gemini-pro\",\n",
    "    temperature=0,\n",
    "    api_key=os.getenv('GEMINI_API_KEY')\n",
    ")\n",
    "\n",
    "neo4j_url = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n",
    "graph = Neo4jGraph(url=neo4j_url,username=neo4j_user,password=neo4j_password,sanitize=True,enhanced_schema=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connect to Neo4j AuraDB"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "- **Player**\n",
      "  - `name`: STRING Example: \"Ronaldinho\"\n",
      "  - `age`: FLOAT Min: 16.0, Max: 44.0\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **Club**\n",
      "  - `name`: STRING Example: \"Querétaro\"\n",
      "- **Foot**\n",
      "  - `type`: STRING Available options: ['Right', 'Left']\n",
      "- **Position**\n",
      "  - `name`: STRING Example: \"CAM\"\n",
      "- **Role**\n",
      "  - `name`: STRING Example: \"Central Attacking Midfielder\"\n",
      "- **Performance**\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "- **Financials**\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **AgeGroup**\n",
      "  - `name`: STRING Available options: ['Veteran', 'Teenager', 'Young Adult', 'Prime']\n",
      "- **Chunk**\n",
      "  - `id`: STRING Example: \"1f735452c42e1fd272da8983e4c73a35\"\n",
      "  - `text`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `question`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `query`: STRING Example: \"MATCH (p:Player) WHERE p.overall_rating > 80 RETUR\"\n",
      "Relationship properties:\n",
      "- **PLAYS_FOR**\n",
      "  - `since: DATE` Min: 2024-12-19, Max:  2024-12-19\n",
      "The relationships:\n",
      "(:Player)-[:PLAYS_FOR]->(:Club)\n",
      "(:Player)-[:USES_FOOT]->(:Foot)\n",
      "(:Player)-[:PLAYS_AS]->(:Position)\n",
      "(:Player)-[:HAS_ROLE]->(:Role)\n",
      "(:Player)-[:HAS_PERFORMANCE]->(:Performance)\n",
      "(:Player)-[:HAS_FINANCIALS]->(:Financials)\n"
     ]
    }
   ],
   "source": [
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Zero shot prompting"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "cypher_model = ChatGroq(temperature=0, model_name=\"llama-3.1-8b-instant\", groq_api_key = os.getenv(\"GROQ_API_KEY\"))\n",
    "# qa_model = ChatGroq(temperature=0, model_name=\"llama-3.1-70b-versatile\", groq_api_key = groq_api_key)\n",
    "qa_model = ChatGroq(temperature=0, model_name=\"gemma2-9b-it\", groq_api_key = os.getenv(\"GROQ_API_KEY\"))\n",
    "# qa_model = ChatGroq(temperature=0, model_name=\"llama3-70b-8192\", groq_api_key = groq_api_key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "questions = [\"List all players who play for FC Barcelona?\",\n",
    "             'List players with higher wage',\n",
    "             'Give me some players whos playing position is CF',\n",
    "             'Give me some players whos playing position is CAM and plays for FC barcelona',\n",
    "             'list me some bayern players',\n",
    "             'list me some right foot players',\n",
    "             'Which players have a potential rating of 85 or higher?',\n",
    "             'What are the best positions of players in Borussia Dortmund?']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "====== START ======\n",
      "List all players who play for FC Barcelona?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE c.name = \"FC Barcelona\" RETURN p\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p': {'name': 'Vitor Roque', 'overall_rating': 76.0, 'potential': 88.0, 'best_overall': 78.0, 'value': 17500000.0, 'age': 18.0, 'release_clause': 39400000.0, 'wage': 44000.0}}, {'p': {'name': 'Pau Cubarsí', 'overall_rating': 64.0, 'potential': 83.0, 'best_overall': 66.0, 'value': 1400000.0, 'age': 16.0, 'release_clause': 3700000.0, 'wage': 1000.0}}, {'p': {'name': 'Balde', 'overall_rating': 81.0, 'potential': 89.0, 'best_overall': 81.0, 'value': 53000000.0, 'age': 19.0, 'release_clause': 119300000.0, 'wage': 70000.0}}, {'p': {'name': 'R. Lewandowski', 'overall_rating': 90.0, 'potential': 90.0, 'best_overall': 90.0, 'value': 58000000.0, 'age': 34.0, 'release_clause': 118900000.0, 'wage': 340000.0}}, {'p': {'name': 'Pedri', 'overall_rating': 86.0, 'potential': 92.0, 'best_overall': 88.0, 'value': 105000000.0, 'age': 20.0, 'release_clause': 236300000.0, 'wage': 165000.0}}, {'p': {'name': 'F. de Jong', 'overall_rating': 87.0, 'potential': 90.0, 'best_overall': 89.0, 'value': 103500000.0, 'age': 26.0, 'release_clause': 219900000.0, 'wage': 240000.0}}, {'p': {'name': 'Gavi', 'overall_rating': 83.0, 'potential': 90.0, 'best_overall': 86.0, 'value': 68500000.0, 'age': 18.0, 'release_clause': 154100000.0, 'wage': 60000.0}}, {'p': {'name': 'R. Araujo', 'overall_rating': 86.0, 'potential': 91.0, 'best_overall': 88.0, 'value': 93000000.0, 'age': 24.0, 'release_clause': 197600000.0, 'wage': 175000.0}}, {'p': {'name': 'Fermín', 'overall_rating': 70.0, 'potential': 81.0, 'best_overall': 74.0, 'value': 3500000.0, 'age': 20.0, 'release_clause': 7900000.0, 'wage': 41000.0}}, {'p': {'name': 'Raphinha', 'overall_rating': 84.0, 'potential': 84.0, 'best_overall': 84.0, 'value': 46000000.0, 'age': 26.0, 'release_clause': 94300000.0, 'wage': 210000.0}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Vitor Roque, Pau Cubarsí, Balde, R. Lewandowski, Pedri, F. de Jong, Gavi, R. Araujo, Fermín, Raphinha \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "List players with higher wage\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.wage > 0 RETURN p.name, p.wage ORDER BY p.wage DESC\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'K. De Bruyne', 'p.wage': 350000.0}, {'p.name': 'E. Haaland', 'p.wage': 340000.0}, {'p.name': 'R. Lewandowski', 'p.wage': 340000.0}, {'p.name': 'Vini Jr.', 'p.wage': 310000.0}, {'p.name': 'F. Valverde', 'p.wage': 270000.0}, {'p.name': 'Bernardo Silva', 'p.wage': 270000.0}, {'p.name': 'M. Salah', 'p.wage': 260000.0}, {'p.name': 'T. Kroos', 'p.wage': 260000.0}, {'p.name': 'T. Courtois', 'p.wage': 250000.0}, {'p.name': 'Rúben Dias', 'p.wage': 250000.0}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "K. De Bruyne has a higher wage.  \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "Give me some players whos playing position is CF\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "list me some bayern players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE c.name = \"Bayern\" RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "list me some right foot players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:USES_FOOT]->(f:Foot) WHERE f.type = 'Right' RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Ronaldinho'}, {'p.name': 'Brahim'}, {'p.name': 'K. Wätjen'}, {'p.name': 'J. Bellingham'}, {'p.name': 'A. Isak'}, {'p.name': 'M. Reus'}, {'p.name': 'L. Stergiou'}, {'p.name': 'W. Zaïre-Emery'}, {'p.name': 'C. Hudson-Odoi'}, {'p.name': 'V. Gyökeres'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "Which players have a potential rating of 85 or higher?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:HAS_PERFORMANCE]->(perf:Performance) WHERE perf.potential >= 85 RETURN p;\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p': {'name': 'Brahim', 'overall_rating': 82.0, 'potential': 86.0, 'best_overall': 84.0, 'value': 43500000.0, 'age': 23.0, 'release_clause': 92400000.0, 'wage': 145000.0}}, {'p': {'name': 'O. Kökçü', 'overall_rating': 82.0, 'potential': 86.0, 'best_overall': 84.0, 'value': 44000000.0, 'age': 22.0, 'release_clause': 91300000.0, 'wage': 18000.0}}, {'p': {'name': 'C. Gakpo', 'overall_rating': 82.0, 'potential': 86.0, 'best_overall': 84.0, 'value': 44000000.0, 'age': 24.0, 'release_clause': 84700000.0, 'wage': 120000.0}}, {'p': {'name': 'D. Kulusevski', 'overall_rating': 82.0, 'potential': 86.0, 'best_overall': 84.0, 'value': 43500000.0, 'age': 23.0, 'release_clause': 85900000.0, 'wage': 100000.0}}, {'p': {'name': 'A. Güler', 'overall_rating': 77.0, 'potential': 88.0, 'best_overall': 79.0, 'value': 22000000.0, 'age': 18.0, 'release_clause': 49500000.0, 'wage': 41000.0}}, {'p': {'name': 'Y. Moukoko', 'overall_rating': 77.0, 'potential': 87.0, 'best_overall': 79.0, 'value': 22500000.0, 'age': 18.0, 'release_clause': 42800000.0, 'wage': 18000.0}}, {'p': {'name': 'Moleiro', 'overall_rating': 77.0, 'potential': 87.0, 'best_overall': 79.0, 'value': 23000000.0, 'age': 19.0, 'release_clause': 52900000.0, 'wage': 12000.0}}, {'p': {'name': 'G. Scalvini', 'overall_rating': 77.0, 'potential': 87.0, 'best_overall': 79.0, 'value': 21000000.0, 'age': 19.0, 'release_clause': 39900000.0, 'wage': 22000.0}}, {'p': {'name': 'N. Fagioli', 'overall_rating': 77.0, 'potential': 87.0, 'best_overall': 79.0, 'value': 23500000.0, 'age': 22.0, 'release_clause': 44700000.0, 'wage': 73000.0}}, {'p': {'name': 'K. Havertz', 'overall_rating': 82.0, 'potential': 87.0, 'best_overall': 85.0, 'value': 46000000.0, 'age': 24.0, 'release_clause': 88600000.0, 'wage': 110000.0}}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "K. Havertz \n",
      "\n",
      "====== END ====== \n",
      "\n",
      "====== START ======\n",
      "What are the best positions of players in Borussia Dortmund?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "====== END ====== \n",
      "\n"
     ]
    }
   ],
   "source": [
    "chain = GraphCypherQAChain.from_llm(graph=graph,\n",
    "                                    cypher_llm = cypher_model,\n",
    "                                    qa_llm= qa_model,\n",
    "                                    verbose=True,\n",
    "                                    validate_cypher = True,\n",
    "                                    allow_dangerous_requests=True\n",
    "                                    # use_function_response = True\n",
    "                                    )\n",
    "results=[]\n",
    "for q in questions:\n",
    "    print('====== START ======')\n",
    "    try:\n",
    "        print(q)\n",
    "        result = chain.invoke(q)['result']\n",
    "        results.append(result)\n",
    "        print(result)\n",
    "    except:\n",
    "        pass\n",
    "    print('====== END ====== \\n')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question:  List all players who play for FC Barcelona?\n",
      "Response:  Vitor Roque, Pau Cubarsí, Balde, R. Lewandowski, Pedri, F. de Jong, Gavi, R. Araujo, Fermín, Raphinha \n",
      "\n",
      "Question:  List players with higher wage\n",
      "Response:  K. De Bruyne has a higher wage.  \n",
      "\n",
      "Question:  Give me some players whos playing position is CF\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  list me some bayern players\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  list me some right foot players\n",
      "Response:  Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "Question:  Which players have a potential rating of 85 or higher?\n",
      "Response:  K. Havertz \n",
      "\n",
      "Question:  What are the best positions of players in Borussia Dortmund?\n",
      "Response:  I don't know the answer. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "for question,result in zip(questions, results):\n",
    "    print(\"Question: \",question)\n",
    "    print(\"Response: \",result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Few shot prompt template"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "examples = [\n",
    "    {\n",
    "        \"question\": \"Which players have an overall rating above 80?\",\n",
    "        \"query\": \"MATCH (p:Player) WHERE p.overall_rating > 80 RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What is the team of the player named Ronaldinho?\",\n",
    "        \"query\": \"MATCH (p:Player {{name: 'Ronaldinho'}})-[:PLAYS_FOR]->(t:Team) RETURN t.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"List all players who play for Real Madrid?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:PLAYS_FOR]->(t:Team {{name: 'Real Madrid'}}) RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which players are left-footed?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:USES_FOOT]->(f:Foot {{type: 'Left'}}) RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What are the best positions of players in Borussia Dortmund?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:PLAYS_FOR]->(t:Team {{name: 'Borussia Dortmund'}}), (p)-[:BEST_POSITION]->(pos:Position) RETURN p.name, pos.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which players have a potential rating of 85 or higher?\",\n",
    "        \"query\": \"MATCH (p:Player) WHERE p.potential >= 85 RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What is the release clause of players whose value exceeds 10 million?\",\n",
    "        \"query\": \"MATCH (p:Player) WHERE p.value > 10000000 RETURN p.name, p.release_clause\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"List all players who are 20 years old or younger and play for Ipswich Town.\",\n",
    "        \"query\": \"MATCH (p:Player)-[:PLAYS_FOR]->(t:Team {{name: 'Ipswich Town'}}) WHERE p.age <= 20 RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which players have 'Central Attacking Midfielder' as their position expansion?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:POSITION_EXPANDED_AS]->(pe:PositionExpansion {{description: 'Central Attacking Midfielder'}}) RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which players play for teams based in Spain?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:PLAYS_FOR]->(t:Team) WHERE t.name IN ['Real Madrid'] RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Which players are right-footed and have a wage above 50,000?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:USES_FOOT]->(f:Foot {{type: 'Right'}}) WHERE p.wage > 50000 RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"Who are the players aged 25 or older with a best overall rating below 70?\",\n",
    "        \"query\": \"MATCH (p:Player) WHERE p.age >= 25 AND p.best_overall < 70 RETURN p.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What is the best position of the youngest player in the dataset?\",\n",
    "        \"query\": \"MATCH (p:Player)-[:BEST_POSITION]->(pos:Position) RETURN p.name, pos.name ORDER BY p.age ASC LIMIT 1\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"What is the overall rating and team of players named Brahim?\",\n",
    "        \"query\": \"MATCH (p:Player {{name: 'Brahim'}})-[:PLAYS_FOR]->(t:Team) RETURN p.name, p.overall_rating, t.name\"\n",
    "    },\n",
    "    {\n",
    "        \"question\": \"How many players are there with an overall rating above 70 and potential above 80?\",\n",
    "        \"query\": \"MATCH (p:Player) WHERE p.overall_rating > 70 AND p.potential > 80 RETURN COUNT(p) AS TotalPlayers\"\n",
    "    }\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain_core.prompts import FewShotPromptTemplate, PromptTemplate\n",
    "\n",
    "example_prompt = PromptTemplate.from_template(\n",
    "    \"User input: {question}\\nCypher query: {query}\"\n",
    ")\n",
    "prompt = FewShotPromptTemplate(\n",
    "    examples=examples[:3],\n",
    "    example_prompt=example_prompt,\n",
    "    prefix=\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nHere is the schema information\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries.\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables=[\"question\", \"schema\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n",
      "\n",
      "Here is the schema information\n",
      "Node properties:\n",
      "- **Player**\n",
      "  - `name`: STRING Example: \"Ronaldinho\"\n",
      "  - `age`: FLOAT Min: 16.0, Max: 44.0\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **Club**\n",
      "  - `name`: STRING Example: \"Querétaro\"\n",
      "- **Foot**\n",
      "  - `type`: STRING Available options: ['Right', 'Left']\n",
      "- **Position**\n",
      "  - `name`: STRING Example: \"CAM\"\n",
      "- **Role**\n",
      "  - `name`: STRING Example: \"Central Attacking Midfielder\"\n",
      "- **Performance**\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "- **Financials**\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **AgeGroup**\n",
      "  - `name`: STRING Available options: ['Veteran', 'Teenager', 'Young Adult', 'Prime']\n",
      "- **Chunk**\n",
      "  - `id`: STRING Example: \"1f735452c42e1fd272da8983e4c73a35\"\n",
      "  - `text`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `question`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `query`: STRING Example: \"MATCH (p:Player) WHERE p.overall_rating > 80 RETUR\"\n",
      "Relationship properties:\n",
      "- **PLAYS_FOR**\n",
      "  - `since: DATE` Min: 2024-12-19, Max:  2024-12-19\n",
      "The relationships:\n",
      "(:Player)-[:PLAYS_FOR]->(:Club)\n",
      "(:Player)-[:USES_FOOT]->(:Foot)\n",
      "(:Player)-[:PLAYS_AS]->(:Position)\n",
      "(:Player)-[:HAS_ROLE]->(:Role)\n",
      "(:Player)-[:HAS_PERFORMANCE]->(:Performance)\n",
      "(:Player)-[:HAS_FINANCIALS]->(:Financials).\n",
      "\n",
      "Below are a number of examples of questions and their corresponding Cypher queries.\n",
      "\n",
      "User input: Which players have an overall rating above 80?\n",
      "Cypher query: MATCH (p:Player) WHERE p.overall_rating > 80 RETURN p.name\n",
      "\n",
      "User input: What is the team of the player named Ronaldinho?\n",
      "Cypher query: MATCH (p:Player {name: 'Ronaldinho'})-[:PLAYS_FOR]->(t:Team) RETURN t.name\n",
      "\n",
      "User input: List all players who play for Real Madrid?\n",
      "Cypher query: MATCH (p:Player)-[:PLAYS_FOR]->(t:Team {name: 'Real Madrid'}) RETURN p.name\n",
      "\n",
      "User input: Name 3 FC barcelona players\n",
      "Cypher query: \n"
     ]
    }
   ],
   "source": [
    "print(prompt.format(question=\"Name 3 FC barcelona players\", schema=graph.schema))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      " List all players who play for FC Barcelona?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mBased on the provided schema and the given examples, I can create a Cypher query for the user input \"List all players who play for FC Barcelona\".\n",
      "\n",
      "Since the schema defines a node type 'Club' instead of 'Team', the correct query should be:\n",
      "\n",
      "Cypher query: MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: 'FC Barcelona'}) RETURN p.name\u001b[0m\n",
      "\n",
      " List players with higher wage\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials)\n",
      "RETURN p.name, f.wage\n",
      "ORDER BY f.wage DESC\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'K. De Bruyne', 'f.wage': 350000.0}, {'p.name': 'E. Haaland', 'f.wage': 340000.0}, {'p.name': 'R. Lewandowski', 'f.wage': 340000.0}, {'p.name': 'Vini Jr.', 'f.wage': 310000.0}, {'p.name': 'F. Valverde', 'f.wage': 270000.0}, {'p.name': 'Bernardo Silva', 'f.wage': 270000.0}, {'p.name': 'Rodri', 'f.wage': 260000.0}, {'p.name': 'M. Salah', 'f.wage': 260000.0}, {'p.name': 'T. Kroos', 'f.wage': 260000.0}, {'p.name': 'T. Courtois', 'f.wage': 250000.0}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "K. De Bruyne has a higher wage.  \n",
      "\n",
      "\n",
      " Give me some players whos playing position is CF\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Position {name: 'CF'})<-[:PLAYS_AS]-(player:Player) RETURN player.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'player.name': 'L. Trossard'}, {'player.name': 'T. Minamino'}, {'player.name': 'M. Depay'}, {'player.name': 'W. Ben Yedder'}, {'player.name': 'Iago Aspas'}, {'player.name': 'J. Correa'}, {'player.name': 'Diogo Jota'}, {'player.name': 'F. Thauvin'}, {'player.name': 'D. Kyereh'}, {'player.name': 'L. Vietto'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "W. Ben Yedder, Iago Aspas  \n",
      "\n",
      "\n",
      " Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: 'FC Barcelona'}), (p)-[:PLAYS_AS]->(pos:Position {name: 'CAM'})\n",
      "RETURN p.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Fermín'}, {'p.name': 'João Félix'}, {'p.name': 'Marc Casadó'}, {'p.name': 'Xavi'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Fermín, João Félix, Marc Casadó, and Xavi. \n",
      "\n",
      "\n",
      " list me some bayern players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: 'Bayern'})\n",
      "RETURN p.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "\n",
      " list me some right foot players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Player)-[:USES_FOOT]->(f:Foot) WHERE f.type = 'Right' RETURN p.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Ronaldinho'}, {'p.name': 'Brahim'}, {'p.name': 'K. Wätjen'}, {'p.name': 'J. Bellingham'}, {'p.name': 'A. Isak'}, {'p.name': 'M. Reus'}, {'p.name': 'L. Stergiou'}, {'p.name': 'W. Zaïre-Emery'}, {'p.name': 'C. Hudson-Odoi'}, {'p.name': 'V. Gyökeres'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "\n",
      " Which players have a potential rating of 85 or higher?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mcypher\n",
      "MATCH (p:Player) WHERE p.potential >= 85 RETURN p.name\n",
      "\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Brahim'}, {'p.name': 'A. Güler'}, {'p.name': 'Y. Moukoko'}, {'p.name': 'K. Havertz'}, {'p.name': 'J. Bellingham'}, {'p.name': 'A. Isak'}, {'p.name': 'C. Palmer'}, {'p.name': 'W. Zaïre-Emery'}, {'p.name': 'V. Gyökeres'}, {'p.name': 'J. Hato'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "\n",
      " What are the best positions of players in Borussia Dortmund?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3m\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "chain_with_few_shot = GraphCypherQAChain.from_llm(graph=graph,\n",
    "                                                  cypher_llm=cypher_model,\n",
    "                                                  qa_llm=qa_model,\n",
    "                                                  cypher_prompt=prompt, # add this\n",
    "                                                  verbose=True,\n",
    "                                                  validate_cypher = True,\n",
    "                                                  allow_dangerous_requests=True\n",
    "                                                  )\n",
    "results=[]\n",
    "for q in questions:\n",
    "    print(\"\\n\", q)\n",
    "    try:\n",
    "        result = chain_with_few_shot.invoke(q)['result']\n",
    "        results.append(result)\n",
    "        print(result)\n",
    "    except:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question:  List all players who play for FC Barcelona?\n",
      "Response:  K. De Bruyne has a higher wage.  \n",
      "\n",
      "Question:  List players with higher wage\n",
      "Response:  W. Ben Yedder, Iago Aspas  \n",
      "\n",
      "Question:  Give me some players whos playing position is CF\n",
      "Response:  Fermín, João Félix, Marc Casadó, and Xavi. \n",
      "\n",
      "Question:  Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  list me some bayern players\n",
      "Response:  Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "Question:  list me some right foot players\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  Which players have a potential rating of 85 or higher?\n",
      "Response:  I don't know the answer. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "for question,result in zip(questions, results):\n",
    "    print(\"Question: \",question)\n",
    "    print(\"Response: \",result)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dynamic Few Shot Prompting"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\COMP\\AppData\\Local\\Temp\\ipykernel_9576\\3151546236.py:7: LangChainDeprecationWarning: The class `HuggingFaceEmbeddings` was deprecated in LangChain 0.2.2 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-huggingface package and should be used instead. To use it run `pip install -U :class:`~langchain-huggingface` and import as `from :class:`~langchain_huggingface import HuggingFaceEmbeddings``.\n",
      "  HuggingFaceEmbeddings(),\n",
      "C:\\Users\\COMP\\AppData\\Local\\Temp\\ipykernel_9576\\3151546236.py:7: LangChainDeprecationWarning: Default values for HuggingFaceEmbeddings.model_name were deprecated in LangChain 0.2.16 and will be removed in 0.4.0. Explicitly pass a model_name to the HuggingFaceEmbeddings constructor instead.\n",
      "  HuggingFaceEmbeddings(),\n"
     ]
    }
   ],
   "source": [
    "from langchain_community.vectorstores import Neo4jVector\n",
    "from langchain_core.example_selectors import SemanticSimilarityExampleSelector\n",
    "from langchain_community.embeddings import HuggingFaceEmbeddings\n",
    "\n",
    "example_selector = SemanticSimilarityExampleSelector.from_examples(\n",
    "    examples,\n",
    "    HuggingFaceEmbeddings(),\n",
    "    Neo4jVector,\n",
    "    url = neo4j_url,\n",
    "    username = neo4j_user,\n",
    "    password = neo4j_password,\n",
    "    k=3,\n",
    "    input_keys=[\"question\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "dynamic_prompt = FewShotPromptTemplate(\n",
    "    example_selector=example_selector, #previous: examples = examples[:3]\n",
    "    example_prompt=example_prompt,\n",
    "    prefix=\"You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\\n\\nHere is the schema information\\n{schema}.\\n\\nBelow are a number of examples of questions and their corresponding Cypher queries. Don't add any preambles, just return the correct cypher query\",\n",
    "    suffix=\"User input: {question}\\nCypher query: \",\n",
    "    input_variables=[\"question\", \"schema\"],\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "You are a Neo4j expert. Given an input question, create a syntactically correct Cypher query to run.\n",
      "\n",
      "Here is the schema information\n",
      "Node properties:\n",
      "- **Player**\n",
      "  - `name`: STRING Example: \"Ronaldinho\"\n",
      "  - `age`: FLOAT Min: 16.0, Max: 44.0\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **Club**\n",
      "  - `name`: STRING Example: \"Querétaro\"\n",
      "- **Foot**\n",
      "  - `type`: STRING Available options: ['Right', 'Left']\n",
      "- **Position**\n",
      "  - `name`: STRING Example: \"CAM\"\n",
      "- **Role**\n",
      "  - `name`: STRING Example: \"Central Attacking Midfielder\"\n",
      "- **Performance**\n",
      "  - `overall_rating`: FLOAT Min: 47.0, Max: 91.0\n",
      "  - `potential`: FLOAT Min: 54.0, Max: 94.0\n",
      "  - `best_overall`: FLOAT Min: 49.0, Max: 93.0\n",
      "- **Financials**\n",
      "  - `value`: FLOAT Min: 0.0, Max: 1.85E8\n",
      "  - `wage`: FLOAT Min: 0.0, Max: 350000.0\n",
      "  - `release_clause`: FLOAT Min: 0.0, Max: 3.561E8\n",
      "- **AgeGroup**\n",
      "  - `name`: STRING Available options: ['Veteran', 'Teenager', 'Young Adult', 'Prime']\n",
      "- **Chunk**\n",
      "  - `id`: STRING Example: \"1f735452c42e1fd272da8983e4c73a35\"\n",
      "  - `text`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `question`: STRING Example: \"Which players have an overall rating above 80?\"\n",
      "  - `query`: STRING Example: \"MATCH (p:Player) WHERE p.overall_rating > 80 RETUR\"\n",
      "Relationship properties:\n",
      "- **PLAYS_FOR**\n",
      "  - `since: DATE` Min: 2024-12-19, Max:  2024-12-19\n",
      "The relationships:\n",
      "(:Player)-[:PLAYS_FOR]->(:Club)\n",
      "(:Player)-[:USES_FOOT]->(:Foot)\n",
      "(:Player)-[:PLAYS_AS]->(:Position)\n",
      "(:Player)-[:HAS_ROLE]->(:Role)\n",
      "(:Player)-[:HAS_PERFORMANCE]->(:Performance)\n",
      "(:Player)-[:HAS_FINANCIALS]->(:Financials).\n",
      "\n",
      "Below are a number of examples of questions and their corresponding Cypher queries. Don't add any preambles, just return the correct cypher query\n",
      "\n",
      "User input: What is the team of the player named Ronaldinho?\n",
      "Cypher query: MATCH (p:Player {name: 'Ronaldinho'})-[:PLAYS_FOR]->(t:Team) RETURN t.name\n",
      "\n",
      "User input: What is the overall rating and team of players named Brahim?\n",
      "Cypher query: MATCH (p:Player {name: 'Brahim'})-[:PLAYS_FOR]->(t:Team) RETURN p.name, p.overall_rating, t.name\n",
      "\n",
      "User input: What are the best positions of players in Borussia Dortmund?\n",
      "Cypher query: MATCH (p:Player)-[:PLAYS_FOR]->(t:Team {name: 'Borussia Dortmund'}), (p)-[:BEST_POSITION]->(pos:Position) RETURN p.name, pos.name\n",
      "\n",
      "User input: Where does Ansu Fati play?\n",
      "Cypher query: \n"
     ]
    }
   ],
   "source": [
    "print(dynamic_prompt.format(question=\"Where does Ansu Fati play?\", schema= graph.schema))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      " List all players who play for FC Barcelona?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_FOR]->(t:Club {name: 'FC Barcelona'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Vitor Roque'}, {'p.name': 'Pau Cubarsí'}, {'p.name': 'Balde'}, {'p.name': 'R. Lewandowski'}, {'p.name': 'Pedri'}, {'p.name': 'F. de Jong'}, {'p.name': 'Gavi'}, {'p.name': 'R. Araujo'}, {'p.name': 'Fermín'}, {'p.name': 'Raphinha'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Vitor Roque, Pau Cubarsí, Balde, R. Lewandowski, Pedri, F. de Jong, Gavi, R. Araujo, Fermín, Raphinha  \n",
      "\n",
      "\n",
      " List players with higher wage\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p1:Player)-[:HAS_FINANCIALS]->(f1:Financials), (p2:Player)-[:HAS_FINANCIALS]->(f2:Financials) WHERE f1.wage > f2.wage RETURN p1.name\u001b[0m\n",
      "\n",
      " Give me some players whos playing position is CF\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_AS]->(pos:Position {name: 'CF'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'L. Trossard'}, {'p.name': 'T. Minamino'}, {'p.name': 'M. Depay'}, {'p.name': 'W. Ben Yedder'}, {'p.name': 'Iago Aspas'}, {'p.name': 'J. Correa'}, {'p.name': 'Diogo Jota'}, {'p.name': 'F. Thauvin'}, {'p.name': 'D. Kyereh'}, {'p.name': 'L. Vietto'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "L. Trossard, M. Depay, W. Ben Yedder, Iago Aspas, Diogo Jota, F. Thauvin, D. Kyereh, L. Vietto  \n",
      "\n",
      "\n",
      " Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_AS]->(pos:Position {name: 'CAM'}), (p)-[:PLAYS_FOR]->(c:Club {name: 'FC Barcelona'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Fermín'}, {'p.name': 'João Félix'}, {'p.name': 'Marc Casadó'}, {'p.name': 'Xavi'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Fermín, João Félix, Marc Casadó, and Xavi. \n",
      "\n",
      "\n",
      " list me some bayern players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_FOR]->(t:Club {name: 'Bayern'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "\n",
      " list me some right foot players\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:USES_FOOT]->(f:Foot {type: 'Right'}) RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Ronaldinho'}, {'p.name': 'Brahim'}, {'p.name': 'K. Wätjen'}, {'p.name': 'J. Bellingham'}, {'p.name': 'A. Isak'}, {'p.name': 'M. Reus'}, {'p.name': 'L. Stergiou'}, {'p.name': 'W. Zaïre-Emery'}, {'p.name': 'C. Hudson-Odoi'}, {'p.name': 'V. Gyökeres'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "\n",
      " Which players have a potential rating of 85 or higher?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player) WHERE p.potential >= 85 RETURN p.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'p.name': 'Brahim'}, {'p.name': 'A. Güler'}, {'p.name': 'Y. Moukoko'}, {'p.name': 'K. Havertz'}, {'p.name': 'J. Bellingham'}, {'p.name': 'A. Isak'}, {'p.name': 'C. Palmer'}, {'p.name': 'W. Zaïre-Emery'}, {'p.name': 'V. Gyökeres'}, {'p.name': 'J. Hato'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "I don't know the answer. \n",
      "\n",
      "\n",
      " What are the best positions of players in Borussia Dortmund?\n",
      "\n",
      "\n",
      "\u001b[1m> Entering new GraphCypherQAChain chain...\u001b[0m\n",
      "Generated Cypher:\n",
      "\u001b[32;1m\u001b[1;3mMATCH (p:Player)-[:PLAYS_FOR]->(t:Club {name: 'Borussia Dortmund'}), (p)-[:PLAYS_AS]->(pos:Position) RETURN pos.name\u001b[0m\n",
      "Full Context:\n",
      "\u001b[32;1m\u001b[1;3m[{'pos.name': 'CAM'}, {'pos.name': 'ST'}, {'pos.name': 'CAM'}, {'pos.name': 'LM'}, {'pos.name': 'ST'}, {'pos.name': 'CAM'}, {'pos.name': 'CAM'}, {'pos.name': 'LWB'}, {'pos.name': 'ST'}, {'pos.name': 'CAM'}]\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "CAM, ST, LM, LWB are the best positions of players in Borussia Dortmund. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "chain_with_dynamic_few_shot = GraphCypherQAChain.from_llm(graph=graph,\n",
    "                                                          cypher_llm=cypher_model,\n",
    "                                                          qa_llm=qa_model,\n",
    "                                                          cypher_prompt=dynamic_prompt, # don't forget to change this into the dynamic_prompt\n",
    "                                                          verbose=True,\n",
    "                                                          validate_cypher = True,\n",
    "                                                          allow_dangerous_requests=True\n",
    "                                                          )\n",
    "results=[]\n",
    "for q in questions:\n",
    "    print(\"\\n\", q)\n",
    "    try:\n",
    "        result = chain_with_dynamic_few_shot.invoke(q)['result']\n",
    "        results.append(result)\n",
    "        print(result)\n",
    "    except:\n",
    "        pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Question:  List all players who play for FC Barcelona?\n",
      "Response:  Vitor Roque, Pau Cubarsí, Balde, R. Lewandowski, Pedri, F. de Jong, Gavi, R. Araujo, Fermín, Raphinha  \n",
      "\n",
      "Question:  List players with higher wage\n",
      "Response:  L. Trossard, M. Depay, W. Ben Yedder, Iago Aspas, Diogo Jota, F. Thauvin, D. Kyereh, L. Vietto  \n",
      "\n",
      "Question:  Give me some players whos playing position is CF\n",
      "Response:  Fermín, João Félix, Marc Casadó, and Xavi. \n",
      "\n",
      "Question:  Give me some players whos playing position is CAM and plays for FC barcelona\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  list me some bayern players\n",
      "Response:  Ronaldinho, Brahim, K. Wätjen, J. Bellingham, A. Isak, M. Reus, L. Stergiou, W. Zaïre-Emery, C. Hudson-Odoi, V. Gyökeres \n",
      "\n",
      "Question:  list me some right foot players\n",
      "Response:  I don't know the answer. \n",
      "\n",
      "Question:  Which players have a potential rating of 85 or higher?\n",
      "Response:  CAM, ST, LM, LWB are the best positions of players in Borussia Dortmund. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "for question,result in zip(questions, results):\n",
    "    print(\"Question: \",question)\n",
    "    print(\"Response: \",result)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
