{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import Libs and load creds"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\COMP\\AppData\\Local\\Temp\\ipykernel_15036\\3675335738.py:20: LangChainDeprecationWarning: The class `Neo4jGraph` was deprecated in LangChain 0.3.8 and will be removed in 1.0. An updated version of the class exists in the :class:`~langchain-neo4j package and should be used instead. To use it run `pip install -U :class:`~langchain-neo4j` and import as `from :class:`~langchain_neo4j import Neo4jGraph``.\n",
      "  graph = Neo4jGraph(url=neo4j_url,username=neo4j_user,password=neo4j_password,sanitize=True,enhanced_schema=True)\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    }
   ],
   "source": [
    "import os\n",
    "import json\n",
    "from typing import List\n",
    "from langchain_groq import ChatGroq\n",
    "import pandas as pd\n",
    "# from langchain_core.pydantic_v1 import BaseModel, Field\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from dotenv import load_dotenv\n",
    "from pydantic import BaseModel,Field\n",
    "\n",
    "\n",
    "llm = ChatGroq(api_key=os.getenv(\"GROQ_API_KEY\"),\n",
    "                 model=\"llama3-8b-8192\"\n",
    "                 \n",
    "                )\n",
    "\n",
    "neo4j_url = os.getenv(\"NEO4J_URI\")\n",
    "neo4j_user = os.getenv(\"NEO4J_USERNAME\")\n",
    "neo4j_password = os.getenv(\"NEO4J_PASSWORD\")\n",
    "graph = Neo4jGraph(url=neo4j_url,username=neo4j_user,password=neo4j_password,sanitize=True,enhanced_schema=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'Cypher is a query language specifically designed for graph databases, such as Neo4j. It\\'s used to retrieve, manipulate, and analyze data stored in a graph structure. Here\\'s an overview of Cypher:\\n\\n**What is Cypher?**\\n\\nCypher is a declarative language, which means you specify what you want to retrieve or manipulate, rather than how to do it. It\\'s similar to SQL (Structured Query Language) for relational databases, but designed for graph databases.\\n\\n**Cypher syntax**\\n\\nCypher queries consist of a series of clauses, which are used to specify the query\\'s intent. The basic syntax is as follows:\\n```cypher\\nMATCH (pattern) [WITH clause] [RETURN clause]\\n```\\nHere:\\n\\n* `MATCH` clause: Specifies the pattern to match in the graph.\\n* `WITH` clause (optional): Allows you to alias or manipulate the matched nodes or relationships.\\n* `RETURN` clause: Specifies the data to be returned.\\n\\n**Cypher patterns**\\n\\nCypher patterns are used to specify the relationships between nodes in the graph. There are several types of patterns:\\n\\n* `node`: Matches a single node.\\n* `rel`: Matches a relationship between two nodes.\\n* `path`: Matches a sequence of relationships between nodes.\\n* `node(n)` : Matches a node with the given label and properties.\\n\\n**Cypher clauses**\\n\\nHere are some common Cypher clauses:\\n\\n* `MATCH` clause: As mentioned earlier, specifies the pattern to match.\\n* `WHERE` clause: Filters the matched nodes or relationships based on conditions.\\n* `WITH` clause: Aliases or manipulates the matched nodes or relationships.\\n* `RETURN` clause: Specifies the data to be returned.\\n* `CREATE` clause: Creates new nodes or relationships.\\n* `MERGE` clause: Merges two nodes or relationships.\\n\\n**Cypher functions**\\n\\nCypher provides several built-in functions to perform various operations, such as:\\n\\n* `id()` : Returns the ID of a node.\\n* `labels()` : Returns the labels of a node.\\n* `relationships()` : Returns the relationships of a node.\\n* `size()` : Returns the number of elements in a collection.\\n* `collect()` : Aggregates a collection.\\n\\n**Cypher examples**\\n\\nHere are a few examples to get you started:\\n\\n* Retrieve all nodes with the label \"Person\":\\n```cypher\\nMATCH (p:Person) RETURN p\\n```\\n* Retrieve all relationships between nodes with the label \"Friend\":\\n```cypher\\nMATCH (a:Person)-[r:FRIEND]->(b:Person) RETURN r\\n```\\n* Create a new node with the label \"Book\" and properties:\\n```cypher\\nCREATE (book:Book {title: \"The Great Gatsby\", author: \"F. Scott Fitzgerald\"})\\n```\\n* Merge two nodes with the same label and properties:\\n```cypher\\nMERGE (a:Person {name: \"John\"}) MERGE (b:Person {name: \"John\"}) ON CREATE SET a = b\\n```\\nThese are just a few examples of what you can do with Cypher. If you\\'re interested in learning more, I recommend checking out the official Neo4j documentation and tutorials.'"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "llm.invoke(\"Hi, explain me about cypher query language\").content"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Pydantic class model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [],
   "source": [
    "class Question(BaseModel):\n",
    "    questions: List[str] = Field(\n",
    "        description=\"List of relevant questions for the particular graph schema. Make sure that questions can be answered with information from the schema and that the questions are diverse as possible. Make sure that the schema and the example values contains the information that can answer the questions! Do not ask questions that cannot be answered based on the provided schema. For example, if no information about subtitles can be found in the graph, don't ask any information about subtitles. Make sure to always limit the results to less than 10 results by saying 3 users, or top 5 movies, or similar.\"\n",
    "    )\n",
    "\n",
    "structured_llm = llm.with_structured_output(Question)\n",
    "\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.prompts import (\n",
    "    HumanMessagePromptTemplate,\n",
    "    SystemMessagePromptTemplate,\n",
    ")\n",
    "\n",
    "\n",
    "system_prompt = \"\"\"Your task is to generate 1000 questions that are directly related to a specific graph schema in Neo4j. Each question should target distinct aspects of the schema, such as relationships between nodes, properties of nodes, or characteristics of node types. Ensure that the questions vary in complexity, covering basic, intermediate, and advanced queries.\n",
    "\n",
    "Avoid ambiguous questions. For clarity, an ambiguous question is one that can be interpreted in multiple ways or does not have a straightforward answer based on the schema. For example, avoid asking, \"What is related to this?\" without specifying the node type or relationship.\n",
    "Please design each question to yield a limited number of results, specifically between 10 to 50 results. This will ensure that the queries are precise and suitable for detailed analysis and training.\n",
    "The goal of these questions is to create a dataset for training AI models to convert natural language queries into Cypher queries effectively.\n",
    "It is vital that the database contains information that can answer the question!\n",
    "Make sure to generate 1000 questions!\"\"\"\n",
    "\n",
    "default_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        SystemMessagePromptTemplate.from_template(\n",
    "            f\"{system_prompt} Follow these instructions create minimum 100 possible questions: {{instructions}}\"\n",
    "        ),\n",
    "        HumanMessagePromptTemplate.from_template(\n",
    "            \"Make sure to create questions for the following graph schema:{input}\\n Here are some example nodes and relationship values: {values}. Don't use any values that aren't found in the schema or in provided values. Also, do not ask questions that there is no way to answer based on the schema or provided example values. Don't include question index or the sequence of the question in the list. Make sure your question is complete and clear\"\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "chain = default_prompt | structured_llm"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Specifying query types using dictionary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_types = {\n",
    "    \"Simple Retrieval Queries\": \"These queries focus on basic data extraction, retrieving nodes or relationships based on straightforward criteria such as labels, properties, or direct relationships. Examples include fetching all nodes labeled as 'Person' or retrieving relationships of a specific type like 'EMPLOYED_BY'. Simple retrieval is essential for initial data inspections and basic reporting tasks. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "    \"Complex Retrieval Queries\": \"These advanced queries use the rich pattern-matching capabilities of Cypher to handle multiple node types and relationship patterns. They involve sophisticated filtering conditions and logical operations to extract nuanced insights from interconnected data points. An example could be finding all 'Person' nodes who work in a 'Department' with over 50 employees and have at least one 'REPORTS_TO' relationship. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "    \"Simple Aggregation Queries\": \"Simple aggregation involves calculating basic statistical metrics over properties of nodes or relationships, such as counting the number of nodes, averaging property values, or determining maximum and minimum values. These queries summarize data characteristics and support quick analytical conclusions. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "    \"Pathfinding Queries\": \"Specialized in exploring connections between nodes, these queries are used to find the shortest path, identify all paths up to a certain length, or explore possible routes within a network. They are essential for applications in network analysis, routing, logistics, and social network exploration. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "    \"Complex Aggregation Queries\": \"The most sophisticated category, these queries involve multiple aggregation functions and often group results over complex subgraphs. They calculate metrics like average number of reports per manager or total sales volume through a network, supporting strategic decision making and advanced reporting. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "    \"Verbose query\": \"These queries are characterized by their explicit and detailed specifications about the data retrieval process and the exact information needed. They involve elaborate instructions for navigating through complex data structures, specifying precise criteria for inclusion, exclusion, and sorting of data points. Verbose queries typically require the breakdown of each step in the querying process, from the initial identification of relevant data nodes and relationships to the intricate filtering and sorting mechanisms that must be applied. Always limit the number of results if more than one row is expected from the questions by saying 'first 3' or 'top 5' elements\",\n",
    "}"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Connect to Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Simple Retrieval Queries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Complex Retrieval Queries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Simple Aggregation Queries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Pathfinding Queries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Complex Aggregation Queries\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: CALL subquery without a variable scope clause is now deprecated. Use CALL (n) { ... }} {position: line: 3, column: 13, offset: 69} for query: '\\n            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\\n            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\\n            RETURN p\\n            '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Verbose query\n"
     ]
    }
   ],
   "source": [
    "graph = Neo4jGraph(url=neo4j_url,username=neo4j_user,password=neo4j_password,sanitize=True,enhanced_schema=True)\n",
    "schema = graph.schema\n",
    "all_questions = []\n",
    "for type in query_types:\n",
    "  print(type)\n",
    "  instructions = f\"{type}: {query_types[type]}\"\n",
    "  values = graph.query(\n",
    "            \"\"\"\n",
    "            MATCH (n) WHERE rand() > 0.6 WITH n LIMIT 2\n",
    "            CALL { WITH n MATCH p=(n)-[*3..3]-() RETURN p LIMIT 1}\n",
    "            RETURN p\n",
    "            \"\"\"\n",
    "            )\n",
    "  questions = chain.invoke( {\"input\": schema, \"instructions\": instructions, \"values\": values})\n",
    "  all_questions.extend([{\"question\": el, \"type\": type} for el in questions.questions])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'question': 'What is the average overall rating of players who play as defenders?', 'type': 'Verbose query'}, {'question': 'What is the name of the club a player named Ronaldinho plays for?', 'type': 'Pathfinding Queries'}, {'question': 'Which players have a release clause above 10,000,000?', 'type': 'Complex Retrieval Queries'}, {'question': 'What is the name of the club with the highest number of players with a wage above 20,000?', 'type': 'Simple Retrieval Queries'}, {'question': 'What is the average overall rating of players who play as goalkeepers?', 'type': 'Verbose query'}, {'question': 'Which players have a performance best overall above 80?', 'type': 'Complex Retrieval Queries'}, {'question': 'Which players have a performance best overall below 70?', 'type': 'Complex Retrieval Queries'}, {'question': 'What is the wage of a player who has a potential of 83.0 and plays for a club named Querétaro and has an overall rating above 80 and plays as a CAM?', 'type': 'Pathfinding Queries'}, {'question': 'What are the names of all players who have a value above 500000?', 'type': 'Complex Aggregation Queries'}, {'question': 'Which players have a performance overall rating below 60?', 'type': 'Complex Retrieval Queries'}]\n"
     ]
    }
   ],
   "source": [
    "\n",
    "import random\n",
    "\n",
    "random_elements = random.sample(all_questions, 10)\n",
    "\n",
    "print(random_elements)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [],
   "source": [
    "all_questions_df = pd.DataFrame.from_records(all_questions)\n",
    "all_questions_df.to_csv('../processed_data/text2cypher_questions.csv', index = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [],
   "source": [
    "class CypherQuery(BaseModel):\n",
    "    cypherquery: str = Field(\n",
    "        description=\"A correct Neo4J Cypher Query Language without any preambles. Make sure that it follows the schema\"\n",
    "    )\n",
    "\n",
    "\n",
    "structured_llm_cypher_query = llm.with_structured_output(CypherQuery)\n",
    "\n",
    "system_prompt_cypher_query = \"\"\"Given an input question, convert it to a Cypher query. No pre-amble.\n",
    "Additional instructions:\n",
    "- Ensure that queries checking for non-null properties use `IS NOT NULL` in a straightforward manner.\n",
    "- Don't use `size((n)--(m))` for counting relationships. Instead use the new `count{{(n)--(m))}}` syntax.\n",
    "- Incorporate the new existential subqueries in examples where the query needs to check for the existence of a pattern.\n",
    "  Example: MATCH (p:Person)-[r:IS_FRIENDS_WITH]->(friend:Person)\n",
    "            WHERE exists{{ (p)-[:WORKS_FOR]->(:Company {{name: 'Neo4j'}})}}\n",
    "            RETURN p, r, friend\"\"\"\n",
    "\n",
    "default_prompt_cypher_query = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        SystemMessagePromptTemplate.from_template(\n",
    "            f\"{system_prompt_cypher_query}\"\n",
    "        ),\n",
    "        HumanMessagePromptTemplate.from_template(\n",
    "            \"\"\"Based on the Neo4j graph schema below, write a Cypher query that would answer the user's question: {schema}\"\n",
    "              Question: {question}\n",
    "              Cypher query:\"\"\"),\n",
    "    ]\n",
    ")\n",
    "\n",
    "chain_cypher_query = default_prompt_cypher_query | structured_llm_cypher_query\n",
    "     "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"MATCH (p:Player)-[r:PLAYS_FOR]->(c:Club) WHERE p.name = 'Vini Jr' RETURN c.name\""
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "chain_cypher_query.invoke({\"schema\": schema, \"question\":\"Whats the team that Vini Jr plays for?\"}).cypherquery"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "\n",
    "graph = Neo4jGraph(url=neo4j_url,username=neo4j_user,password=neo4j_password,sanitize=True,enhanced_schema=True)\n",
    "schema = graph.schema\n",
    "\n",
    "def get_cypher_query(question):\n",
    "    cypher_query = chain_cypher_query.invoke({\"schema\": schema, \"question\": question}).cypherquery\n",
    "    time.sleep(1)\n",
    "    return cypher_query\n",
    "\n",
    "def safe_get_cypher_query(question):\n",
    "    retry_count = 3\n",
    "    for attempt in range(retry_count):\n",
    "        try:\n",
    "            result = get_cypher_query(question)\n",
    "            print(question, ':', result)\n",
    "            return result\n",
    "        except Exception as e:\n",
    "            print(f\"Error: {e}. Retrying ({attempt + 1}/{retry_count})...\")\n",
    "            time.sleep(random.uniform(1, 3))\n",
    "    return None"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "What is the name of the player with the highest overall rating and the highest potential rating and the highest wage and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating? : MATCH (p:Player)\n",
      "WITH p, max(p.overall_rating) as max_overall, max(p.potential) as max_potential, max(p.wage) as max_wage, max(p.release_clause) as max_release_clause\n",
      "WHERE p.overall_rating = max_overall AND p.potential = max_potential AND p.wage = max_wage AND p.release_clause = max_release_clause\n",
      "RETURN p.name\n",
      "What is the name of the player with the highest overall rating and the highest potential rating and the highest wage and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value? : MATCH (p:Player) WITH p ORDER BY p.overall_rating DESC, p.potential DESC, p.wage DESC, p.release_clause DESC RETURN p.name AS name\n",
      "What is the name of the player with the highest overall rating and the highest potential rating and the highest wage and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating? : MATCH (p:Player) WHERE p.overall_rating > 80 AND p.potential > 80 AND p.wage > 0 AND p.release_clause > 0 RETURN p.name AS name, p.overall_rating AS overall_rating, p.potential AS potential, p.wage AS wage, p.release_clause AS release_clause ORDER BY p.overall_rating DESC, p.potential DESC, p.wage DESC, p.release_clause DESC LIMIT 1\n",
      "What is the name of the player with the highest overall rating and the highest potential rating and the highest wage and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating? : MATCH (p:Player) WHERE p.overall_rating > 80 AND p.potential > 80 AND p.wage > 0 AND p.release_clause > 0 RETURN p.name, p.overall_rating, p.potential, p.wage, p.release_clause ORDER BY p.overall_rating DESC, p.potential DESC, p.wage DESC, p.release_clause DESC LIMIT 1\n",
      "What is the name of the player with the highest overall rating and the highest potential rating and the highest wage and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating and the highest release clause value and the highest overall rating and the highest potential rating? : MATCH (p:Player) WHERE p.overall_rating > 80 AND p.potential > 0 AND p.wage > 0 AND p.release_clause > 0 RETURN p.name\n",
      "What is the total value of all players with an overall rating above 85? : MATCH (p:Player) WHERE p.overall_rating > 85 RETURN sum(p.value) AS total_value\n",
      "Which clubs have the most players with an overall rating above 85? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player) WHERE p.overall_rating > 85 RETURN c.name, count(p) AS count ORDER BY count DESC\n",
      "What is the average wage of all players with an overall rating above 85? : MATCH (p:Player) WHERE p.overall_rating > 85 RETURN avg(p.wage) AS average_wage\n",
      "Which players have a best overall rating above 85? : MATCH (p:Player) WHERE p.best_overall > 85 RETURN p\n",
      "Which clubs have the most players with a best overall rating above 85? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:HAS_PERFORMANCE]->(perf:Performance) WHERE perf.best_overall > 85 WITH c, COUNT(p) AS num_players RETURN c, num_players ORDER BY num_players DESC\n",
      "What is the average wage of all players with a best overall rating above 85? : MATCH (p:Player) WHERE p.best_overall > 85 MATCH (p)-[r:HAS_FINANCIALS]->(f:Financials) RETURN avg(f.wage) AS average_wage\n",
      "Which players have a value above 20M? : MATCH (p:Player) WHERE p.value > 20000000 RETURN p\n",
      "What is the total release clause of all players with a value above 20M? : MATCH (p:Player)-[r:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 20000000.0 RETURN sum(f.release_clause) AS total_release_clause\n",
      "Which clubs have the most players with a value above 20M? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 20000000 GROUP BY c ORDER BY size(collect(p)) DESC RETURN c\n",
      "What is the average wage of all players with a value above 20M? : MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 20000000.0 RETURN avg(f.wage)\n",
      "Which players have an overall rating above 80 and a value above 10M? : MATCH (p:Player) WHERE p.overall_rating > 80 AND p.value > 10E6 RETURN p.name, p.overall_rating, p.value\n",
      "What is the total value of all players with an overall rating above 80 and a value above 10M? : MATCH (player:Player)-[:HAS_FINANCIALS]->(financials:Financials)-[:HAS_PERFORMANCE]->(performance:Performance) WHERE player.overall_rating > 80 AND financials.value > 10000000 RETURN sum(financials.value) AS total_value\n",
      "Which clubs have the most players with an overall rating above 80 and a value above 10M? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player) WHERE p.overall_rating > 80 AND p.value > 10000000 MATCH (c) WITH c, COLLECT(DISTINCT p) AS players ORDER BY SIZE(players) DESC RETURN c, players LIMIT 10\n",
      "What is the average wage of all players with an overall rating above 80 and a value above 10M? : MATCH (p:Player) WHERE p.overall_rating > 80 AND p.value > 10000000.0 RETURN avg(p.wage) AS average_wage\n",
      "Which players have a best overall rating above 80 and a value above 10M? : MATCH (p:Player) WHERE p.best_overall > 80 AND p.value > 10000000 RETURN p\n",
      "What is the total value of all players with a best overall rating above 80 and a value above 10M? : MATCH (p:Player)-[:HAS_PERFORMANCE]->(perf:Performance)-[:HAS_FINANCIALS]->(fin:Financials) WHERE perf.best_overall > 80 AND fin.value > 10000000 RETURN sum(fin.value) as total_value\n",
      "Which clubs have the most players with a best overall rating above 80 and a value above 10M? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player) WHERE p.best_overall > 80 AND p.value > 10000000 RETURN c.name AS club, COUNT(DISTINCT p) AS count ORDER BY count DESC LIMIT 10\n",
      "What is the average wage of all players with a best overall rating above 80 and a value above 10M? : MATCH (p:Player) WHERE p.best_overall > 80 AND p.value > 10000000.0 RETURN avg(p.wage) AS average_wage\n",
      "Which players have a value above 50M and a release clause above 10M? : MATCH (p:Player) WHERE p.value > 5000000 AND p.release_clause > 10000000 RETURN p\n",
      "What is the total value of all players with a value above 50M and a release clause above 10M? : MATCH (p:Player)-[r:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 50000000 AND f.release_clause > 10000000 RETURN sum(f.value) AS total_value\n",
      "Which clubs have the most players with a value above 50M and a release clause above 10M? : MATCH (c:Club)-[:PLAYS_FOR]-(p:Player) WHERE p.value > 5000000 AND p.release_clause > 10000000 RETURN c.name AS club_name\n",
      "What is the average wage of all players with a value above 50M and a release clause above 10M? : MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 50000000 AND f.release_clause > 10000000 RETURN avg(f.wage)\n",
      "Which players have an overall rating above 85 and a value above 10M? : MATCH (p:Player) WHERE p.overall_rating > 85 AND p.value > 10000000 RETURN p\n",
      "What is the total value of all players with an overall rating above 85 and a value above 10M? : MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE p.overall_rating > 85 AND p.value > 10000000 RETURN sum(p.value) AS total_value\n",
      "Which clubs have the most players with an overall rating above 85 and a value above 10M? : MATCH (c:Club)-->(p:Player) WHERE p.overall_rating > 85 AND p.value > 10000000 RETURN c.name AS club_name, COUNT(DISTINCT p) AS num_players ORDER BY num_players DESC\n",
      "What is the average wage of all players with an overall rating above 85 and a value above 10M? : MATCH (p:Player) WHERE p.overall_rating > 85 AND p.value > 10000000 RETURN p.wage AS wage SUM(wage) AS total_wage / size(collect(p)) AS avg_wage\n",
      "Which players have a best overall rating above 85 and a value above 10M? : MATCH (p:Player) WHERE p.best_overall > 85 AND p.value > 1e7 RETURN p\n",
      "What is the total value of all players with a best overall rating above 85 and a value above 10M? : MATCH (p:Player) WHERE p.best_overall > 85 AND p.value > 10000000 RETURN sum(p.value) AS total_value\n",
      "Which clubs have the most players with a best overall rating above 85 and a value above 10M? : MATCH (club:Club)-[:PLAYS_FOR]-(player:Player)-[:HAS_PERFORMANCE]->(performance:Performance) WHERE performance.best_overall > 85 AND player.HAS_FINANCIALS->(:Financials {value: {gt: 10000000}}) RETURN DISTINCT club\n",
      "What is the average wage of all players with a best overall rating above 85 and a value above 10M? : MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE p.best_overall > 85 AND p.value > 10000000 MATCH (p)-[:HAS_FINANCIALS]->(f:Financials) RETURN avg(f.wage) AS average_wage\n",
      "Which players have a value above 20M and a release clause above 10M? : MATCH (p:Player) WHERE p.value > 20000000 AND p.release_clause > 10000000 RETURN p\n",
      "What is the total value of all players with a value above 20M and a release clause above 10M? : MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 20000000 AND f.release_clause > 10000000 RETURN sum(p.value) AS total_value\n",
      "Which clubs have the most players with a value above 20M and a release clause above 10M? : MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 20000000 AND f.release_clause > 10000000 RETURN c.name AS club, COUNT(DISTINCT p) AS num_players\n",
      "Error: Error code: 400 - {'error': {'message': \"Failed to call a function. Please adjust your prompt. See 'failed_generation' for more details.\", 'type': 'invalid_request_error', 'code': 'tool_use_failed', 'failed_generation': '<tool-use>\\n{\\n    \"tool_calls\": [\\n        {\\n            \"id\": \"pending\",\\n            \"type\": \"function\",\\n            \"function\": {\\n                \"name\": \"CypherQuery\"\\n            },\\n            \"parameters\": {\\n                \"properties\": {\\n                    \"cypherquery\": \"MATCH (p:Player) WHERE p.value > 20000000 AND p.release_clause > 10000000 RETURN avg(p.wage)\"\\n                }\\n            }\\n        }\\n    ]\\n}\\n</tool-use>'}}. Retrying (1/3)...\n"
     ]
    },
    {
     "ename": "NameError",
     "evalue": "name 'random' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mBadRequestError\u001b[0m                           Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[13], line 15\u001b[0m, in \u001b[0;36msafe_get_cypher_query\u001b[1;34m(question)\u001b[0m\n\u001b[0;32m     14\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m---> 15\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[43mget_cypher_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     16\u001b[0m     \u001b[38;5;28mprint\u001b[39m(question, \u001b[38;5;124m'\u001b[39m\u001b[38;5;124m:\u001b[39m\u001b[38;5;124m'\u001b[39m, result)\n",
      "Cell \u001b[1;32mIn[13], line 7\u001b[0m, in \u001b[0;36mget_cypher_query\u001b[1;34m(question)\u001b[0m\n\u001b[0;32m      6\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mget_cypher_query\u001b[39m(question):\n\u001b[1;32m----> 7\u001b[0m     cypher_query \u001b[38;5;241m=\u001b[39m \u001b[43mchain_cypher_query\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\u001b[43m{\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mschema\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mschema\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mquestion\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mquestion\u001b[49m\u001b[43m}\u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39mcypherquery\n\u001b[0;32m      8\u001b[0m     time\u001b[38;5;241m.\u001b[39msleep(\u001b[38;5;241m1\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\runnables\\base.py:3024\u001b[0m, in \u001b[0;36mRunnableSequence.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m   3023\u001b[0m         \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[1;32m-> 3024\u001b[0m             \u001b[38;5;28minput\u001b[39m \u001b[38;5;241m=\u001b[39m context\u001b[38;5;241m.\u001b[39mrun(step\u001b[38;5;241m.\u001b[39minvoke, \u001b[38;5;28minput\u001b[39m, config)\n\u001b[0;32m   3025\u001b[0m \u001b[38;5;66;03m# finish the root run\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\runnables\\base.py:5354\u001b[0m, in \u001b[0;36mRunnableBindingBase.invoke\u001b[1;34m(self, input, config, **kwargs)\u001b[0m\n\u001b[0;32m   5348\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minvoke\u001b[39m(\n\u001b[0;32m   5349\u001b[0m     \u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m   5350\u001b[0m     \u001b[38;5;28minput\u001b[39m: Input,\n\u001b[0;32m   5351\u001b[0m     config: Optional[RunnableConfig] \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mNone\u001b[39;00m,\n\u001b[0;32m   5352\u001b[0m     \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs: Optional[Any],\n\u001b[0;32m   5353\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m Output:\n\u001b[1;32m-> 5354\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mbound\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minvoke\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   5355\u001b[0m \u001b[43m        \u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m   5356\u001b[0m \u001b[43m        \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_merge_configs\u001b[49m\u001b[43m(\u001b[49m\u001b[43mconfig\u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   5357\u001b[0m \u001b[43m        \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43m{\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m}\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   5358\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\language_models\\chat_models.py:286\u001b[0m, in \u001b[0;36mBaseChatModel.invoke\u001b[1;34m(self, input, config, stop, **kwargs)\u001b[0m\n\u001b[0;32m    283\u001b[0m config \u001b[38;5;241m=\u001b[39m ensure_config(config)\n\u001b[0;32m    284\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m cast(\n\u001b[0;32m    285\u001b[0m     ChatGeneration,\n\u001b[1;32m--> 286\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgenerate_prompt\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    287\u001b[0m \u001b[43m        \u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_convert_input\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43minput\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    288\u001b[0m \u001b[43m        \u001b[49m\u001b[43mstop\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstop\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    289\u001b[0m \u001b[43m        \u001b[49m\u001b[43mcallbacks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mcallbacks\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    290\u001b[0m \u001b[43m        \u001b[49m\u001b[43mtags\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtags\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    291\u001b[0m \u001b[43m        \u001b[49m\u001b[43mmetadata\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mmetadata\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    292\u001b[0m \u001b[43m        \u001b[49m\u001b[43mrun_name\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mget\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mrun_name\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    293\u001b[0m \u001b[43m        \u001b[49m\u001b[43mrun_id\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconfig\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpop\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mrun_id\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    294\u001b[0m \u001b[43m        \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    295\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241m.\u001b[39mgenerations[\u001b[38;5;241m0\u001b[39m][\u001b[38;5;241m0\u001b[39m],\n\u001b[0;32m    296\u001b[0m )\u001b[38;5;241m.\u001b[39mmessage\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\language_models\\chat_models.py:786\u001b[0m, in \u001b[0;36mBaseChatModel.generate_prompt\u001b[1;34m(self, prompts, stop, callbacks, **kwargs)\u001b[0m\n\u001b[0;32m    785\u001b[0m prompt_messages \u001b[38;5;241m=\u001b[39m [p\u001b[38;5;241m.\u001b[39mto_messages() \u001b[38;5;28;01mfor\u001b[39;00m p \u001b[38;5;129;01min\u001b[39;00m prompts]\n\u001b[1;32m--> 786\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mgenerate\u001b[49m\u001b[43m(\u001b[49m\u001b[43mprompt_messages\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstop\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstop\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mcallbacks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mcallbacks\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\language_models\\chat_models.py:643\u001b[0m, in \u001b[0;36mBaseChatModel.generate\u001b[1;34m(self, messages, stop, callbacks, tags, metadata, run_name, run_id, **kwargs)\u001b[0m\n\u001b[0;32m    642\u001b[0m             run_managers[i]\u001b[38;5;241m.\u001b[39mon_llm_error(e, response\u001b[38;5;241m=\u001b[39mLLMResult(generations\u001b[38;5;241m=\u001b[39m[]))\n\u001b[1;32m--> 643\u001b[0m         \u001b[38;5;28;01mraise\u001b[39;00m e\n\u001b[0;32m    644\u001b[0m flattened_outputs \u001b[38;5;241m=\u001b[39m [\n\u001b[0;32m    645\u001b[0m     LLMResult(generations\u001b[38;5;241m=\u001b[39m[res\u001b[38;5;241m.\u001b[39mgenerations], llm_output\u001b[38;5;241m=\u001b[39mres\u001b[38;5;241m.\u001b[39mllm_output)  \u001b[38;5;66;03m# type: ignore[list-item]\u001b[39;00m\n\u001b[0;32m    646\u001b[0m     \u001b[38;5;28;01mfor\u001b[39;00m res \u001b[38;5;129;01min\u001b[39;00m results\n\u001b[0;32m    647\u001b[0m ]\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\language_models\\chat_models.py:633\u001b[0m, in \u001b[0;36mBaseChatModel.generate\u001b[1;34m(self, messages, stop, callbacks, tags, metadata, run_name, run_id, **kwargs)\u001b[0m\n\u001b[0;32m    631\u001b[0m \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m    632\u001b[0m     results\u001b[38;5;241m.\u001b[39mappend(\n\u001b[1;32m--> 633\u001b[0m         \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_generate_with_cache\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    634\u001b[0m \u001b[43m            \u001b[49m\u001b[43mm\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    635\u001b[0m \u001b[43m            \u001b[49m\u001b[43mstop\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstop\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    636\u001b[0m \u001b[43m            \u001b[49m\u001b[43mrun_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrun_managers\u001b[49m\u001b[43m[\u001b[49m\u001b[43mi\u001b[49m\u001b[43m]\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mif\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mrun_managers\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43;01melse\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mNone\u001b[39;49;00m\u001b[43m,\u001b[49m\n\u001b[0;32m    637\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    638\u001b[0m \u001b[43m        \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    639\u001b[0m     )\n\u001b[0;32m    640\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mBaseException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_core\\language_models\\chat_models.py:851\u001b[0m, in \u001b[0;36mBaseChatModel._generate_with_cache\u001b[1;34m(self, messages, stop, run_manager, **kwargs)\u001b[0m\n\u001b[0;32m    850\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m inspect\u001b[38;5;241m.\u001b[39msignature(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_generate)\u001b[38;5;241m.\u001b[39mparameters\u001b[38;5;241m.\u001b[39mget(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mrun_manager\u001b[39m\u001b[38;5;124m\"\u001b[39m):\n\u001b[1;32m--> 851\u001b[0m     result \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_generate\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    852\u001b[0m \u001b[43m        \u001b[49m\u001b[43mmessages\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstop\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstop\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mrun_manager\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mrun_manager\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\n\u001b[0;32m    853\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    854\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\langchain_groq\\chat_models.py:474\u001b[0m, in \u001b[0;36mChatGroq._generate\u001b[1;34m(self, messages, stop, run_manager, **kwargs)\u001b[0m\n\u001b[0;32m    470\u001b[0m params \u001b[38;5;241m=\u001b[39m {\n\u001b[0;32m    471\u001b[0m     \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mparams,\n\u001b[0;32m    472\u001b[0m     \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs,\n\u001b[0;32m    473\u001b[0m }\n\u001b[1;32m--> 474\u001b[0m response \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mclient\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mcreate\u001b[49m\u001b[43m(\u001b[49m\u001b[43mmessages\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmessage_dicts\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mparams\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    475\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_create_chat_result(response)\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\resources\\chat\\completions.py:298\u001b[0m, in \u001b[0;36mCompletions.create\u001b[1;34m(self, messages, model, frequency_penalty, function_call, functions, logit_bias, logprobs, max_tokens, n, parallel_tool_calls, presence_penalty, response_format, seed, stop, stream, temperature, tool_choice, tools, top_logprobs, top_p, user, extra_headers, extra_query, extra_body, timeout)\u001b[0m\n\u001b[0;32m    188\u001b[0m \u001b[38;5;250m\u001b[39m\u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[0;32m    189\u001b[0m \u001b[38;5;124;03mCreates a model response for the given chat conversation.\u001b[39;00m\n\u001b[0;32m    190\u001b[0m \n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m    296\u001b[0m \u001b[38;5;124;03m  timeout: Override the client-level default timeout for this request, in seconds\u001b[39;00m\n\u001b[0;32m    297\u001b[0m \u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[1;32m--> 298\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_post\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    299\u001b[0m \u001b[43m    \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43m/openai/v1/chat/completions\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m    300\u001b[0m \u001b[43m    \u001b[49m\u001b[43mbody\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmaybe_transform\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    301\u001b[0m \u001b[43m        \u001b[49m\u001b[43m{\u001b[49m\n\u001b[0;32m    302\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mmessages\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mmessages\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    303\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mmodel\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mmodel\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    304\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mfrequency_penalty\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mfrequency_penalty\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    305\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mfunction_call\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mfunction_call\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    306\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mfunctions\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mfunctions\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    307\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mlogit_bias\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mlogit_bias\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    308\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mlogprobs\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mlogprobs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    309\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mmax_tokens\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mmax_tokens\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    310\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mn\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mn\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    311\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mparallel_tool_calls\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mparallel_tool_calls\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    312\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mpresence_penalty\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mpresence_penalty\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    313\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mresponse_format\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mresponse_format\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    314\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mseed\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mseed\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    315\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mstop\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mstop\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    316\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mstream\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mstream\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    317\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtemperature\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mtemperature\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    318\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtool_choice\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mtool_choice\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    319\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtools\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mtools\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    320\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtop_logprobs\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mtop_logprobs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    321\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mtop_p\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43mtop_p\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    322\u001b[0m \u001b[43m            \u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43muser\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43muser\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    323\u001b[0m \u001b[43m        \u001b[49m\u001b[43m}\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    324\u001b[0m \u001b[43m        \u001b[49m\u001b[43mcompletion_create_params\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mCompletionCreateParams\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    325\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    326\u001b[0m \u001b[43m    \u001b[49m\u001b[43moptions\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mmake_request_options\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    327\u001b[0m \u001b[43m        \u001b[49m\u001b[43mextra_headers\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mextra_headers\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mextra_query\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mextra_query\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mextra_body\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mextra_body\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mtimeout\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mtimeout\u001b[49m\n\u001b[0;32m    328\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    329\u001b[0m \u001b[43m    \u001b[49m\u001b[43mcast_to\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mChatCompletion\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    330\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;129;43;01mor\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[38;5;28;43;01mFalse\u001b[39;49;00m\u001b[43m,\u001b[49m\n\u001b[0;32m    331\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream_cls\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mStream\u001b[49m\u001b[43m[\u001b[49m\u001b[43mChatCompletionChunk\u001b[49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    332\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\_base_client.py:1263\u001b[0m, in \u001b[0;36mSyncAPIClient.post\u001b[1;34m(self, path, cast_to, body, options, files, stream, stream_cls)\u001b[0m\n\u001b[0;32m   1260\u001b[0m opts \u001b[38;5;241m=\u001b[39m FinalRequestOptions\u001b[38;5;241m.\u001b[39mconstruct(\n\u001b[0;32m   1261\u001b[0m     method\u001b[38;5;241m=\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mpost\u001b[39m\u001b[38;5;124m\"\u001b[39m, url\u001b[38;5;241m=\u001b[39mpath, json_data\u001b[38;5;241m=\u001b[39mbody, files\u001b[38;5;241m=\u001b[39mto_httpx_files(files), \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39moptions\n\u001b[0;32m   1262\u001b[0m )\n\u001b[1;32m-> 1263\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m cast(ResponseT, \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrequest\u001b[49m\u001b[43m(\u001b[49m\u001b[43mcast_to\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mopts\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstream\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mstream_cls\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream_cls\u001b[49m\u001b[43m)\u001b[49m)\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\_base_client.py:955\u001b[0m, in \u001b[0;36mSyncAPIClient.request\u001b[1;34m(self, cast_to, options, remaining_retries, stream, stream_cls)\u001b[0m\n\u001b[0;32m    953\u001b[0m     retries_taken \u001b[38;5;241m=\u001b[39m \u001b[38;5;241m0\u001b[39m\n\u001b[1;32m--> 955\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_request\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    956\u001b[0m \u001b[43m    \u001b[49m\u001b[43mcast_to\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mcast_to\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    957\u001b[0m \u001b[43m    \u001b[49m\u001b[43moptions\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43moptions\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    958\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    959\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream_cls\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream_cls\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    960\u001b[0m \u001b[43m    \u001b[49m\u001b[43mretries_taken\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mretries_taken\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m    961\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\_base_client.py:1043\u001b[0m, in \u001b[0;36mSyncAPIClient._request\u001b[1;34m(self, cast_to, options, retries_taken, stream, stream_cls)\u001b[0m\n\u001b[0;32m   1042\u001b[0m     err\u001b[38;5;241m.\u001b[39mresponse\u001b[38;5;241m.\u001b[39mclose()\n\u001b[1;32m-> 1043\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_retry_request\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   1044\u001b[0m \u001b[43m        \u001b[49m\u001b[43minput_options\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1045\u001b[0m \u001b[43m        \u001b[49m\u001b[43mcast_to\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1046\u001b[0m \u001b[43m        \u001b[49m\u001b[43mretries_taken\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mretries_taken\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1047\u001b[0m \u001b[43m        \u001b[49m\u001b[43mresponse_headers\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43merr\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresponse\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mheaders\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1048\u001b[0m \u001b[43m        \u001b[49m\u001b[43mstream\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1049\u001b[0m \u001b[43m        \u001b[49m\u001b[43mstream_cls\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream_cls\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1050\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1052\u001b[0m \u001b[38;5;66;03m# If the response is streamed then we need to explicitly read the response\u001b[39;00m\n\u001b[0;32m   1053\u001b[0m \u001b[38;5;66;03m# to completion before attempting to access the response text.\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\_base_client.py:1092\u001b[0m, in \u001b[0;36mSyncAPIClient._retry_request\u001b[1;34m(self, options, cast_to, retries_taken, response_headers, stream, stream_cls)\u001b[0m\n\u001b[0;32m   1090\u001b[0m time\u001b[38;5;241m.\u001b[39msleep(timeout)\n\u001b[1;32m-> 1092\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_request\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   1093\u001b[0m \u001b[43m    \u001b[49m\u001b[43moptions\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43moptions\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1094\u001b[0m \u001b[43m    \u001b[49m\u001b[43mcast_to\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mcast_to\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1095\u001b[0m \u001b[43m    \u001b[49m\u001b[43mretries_taken\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mretries_taken\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m+\u001b[39;49m\u001b[43m \u001b[49m\u001b[38;5;241;43m1\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1096\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1097\u001b[0m \u001b[43m    \u001b[49m\u001b[43mstream_cls\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mstream_cls\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   1098\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\groq\\_base_client.py:1058\u001b[0m, in \u001b[0;36mSyncAPIClient._request\u001b[1;34m(self, cast_to, options, retries_taken, stream, stream_cls)\u001b[0m\n\u001b[0;32m   1057\u001b[0m     log\u001b[38;5;241m.\u001b[39mdebug(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mRe-raising status error\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m-> 1058\u001b[0m     \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_make_status_error_from_response(err\u001b[38;5;241m.\u001b[39mresponse) \u001b[38;5;28;01mfrom\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[0;32m   1060\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_response(\n\u001b[0;32m   1061\u001b[0m     cast_to\u001b[38;5;241m=\u001b[39mcast_to,\n\u001b[0;32m   1062\u001b[0m     options\u001b[38;5;241m=\u001b[39moptions,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   1066\u001b[0m     retries_taken\u001b[38;5;241m=\u001b[39mretries_taken,\n\u001b[0;32m   1067\u001b[0m )\n",
      "\u001b[1;31mBadRequestError\u001b[0m: Error code: 400 - {'error': {'message': \"Failed to call a function. Please adjust your prompt. See 'failed_generation' for more details.\", 'type': 'invalid_request_error', 'code': 'tool_use_failed', 'failed_generation': '<tool-use>\\n{\\n    \"tool_calls\": [\\n        {\\n            \"id\": \"pending\",\\n            \"type\": \"function\",\\n            \"function\": {\\n                \"name\": \"CypherQuery\"\\n            },\\n            \"parameters\": {\\n                \"properties\": {\\n                    \"cypherquery\": \"MATCH (p:Player) WHERE p.value > 20000000 AND p.release_clause > 10000000 RETURN avg(p.wage)\"\\n                }\\n            }\\n        }\\n    ]\\n}\\n</tool-use>'}}",
      "\nDuring handling of the above exception, another exception occurred:\n",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[14], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m df[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mcypher\u001b[39m\u001b[38;5;124m'\u001b[39m] \u001b[38;5;241m=\u001b[39m \u001b[43mdf\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mquestion\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m]\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mapply\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43;01mlambda\u001b[39;49;00m\u001b[43m \u001b[49m\u001b[43mq\u001b[49m\u001b[43m:\u001b[49m\u001b[43m \u001b[49m\u001b[43msafe_get_cypher_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mq\u001b[49m\u001b[43m)\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\pandas\\core\\series.py:4924\u001b[0m, in \u001b[0;36mSeries.apply\u001b[1;34m(self, func, convert_dtype, args, by_row, **kwargs)\u001b[0m\n\u001b[0;32m   4789\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mapply\u001b[39m(\n\u001b[0;32m   4790\u001b[0m     \u001b[38;5;28mself\u001b[39m,\n\u001b[0;32m   4791\u001b[0m     func: AggFuncType,\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   4796\u001b[0m     \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs,\n\u001b[0;32m   4797\u001b[0m ) \u001b[38;5;241m-\u001b[39m\u001b[38;5;241m>\u001b[39m DataFrame \u001b[38;5;241m|\u001b[39m Series:\n\u001b[0;32m   4798\u001b[0m \u001b[38;5;250m    \u001b[39m\u001b[38;5;124;03m\"\"\"\u001b[39;00m\n\u001b[0;32m   4799\u001b[0m \u001b[38;5;124;03m    Invoke function on values of Series.\u001b[39;00m\n\u001b[0;32m   4800\u001b[0m \n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m   4915\u001b[0m \u001b[38;5;124;03m    dtype: float64\u001b[39;00m\n\u001b[0;32m   4916\u001b[0m \u001b[38;5;124;03m    \"\"\"\u001b[39;00m\n\u001b[0;32m   4917\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mSeriesApply\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   4918\u001b[0m \u001b[43m        \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[43m,\u001b[49m\n\u001b[0;32m   4919\u001b[0m \u001b[43m        \u001b[49m\u001b[43mfunc\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   4920\u001b[0m \u001b[43m        \u001b[49m\u001b[43mconvert_dtype\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconvert_dtype\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   4921\u001b[0m \u001b[43m        \u001b[49m\u001b[43mby_row\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mby_row\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   4922\u001b[0m \u001b[43m        \u001b[49m\u001b[43margs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[0;32m   4923\u001b[0m \u001b[43m        \u001b[49m\u001b[43mkwargs\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m,\u001b[49m\n\u001b[1;32m-> 4924\u001b[0m \u001b[43m    \u001b[49m\u001b[43m)\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mapply\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\pandas\\core\\apply.py:1427\u001b[0m, in \u001b[0;36mSeriesApply.apply\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1424\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39mapply_compat()\n\u001b[0;32m   1426\u001b[0m \u001b[38;5;66;03m# self.func is Callable\u001b[39;00m\n\u001b[1;32m-> 1427\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mapply_standard\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\pandas\\core\\apply.py:1507\u001b[0m, in \u001b[0;36mSeriesApply.apply_standard\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m   1501\u001b[0m \u001b[38;5;66;03m# row-wise access\u001b[39;00m\n\u001b[0;32m   1502\u001b[0m \u001b[38;5;66;03m# apply doesn't have a `na_action` keyword and for backward compat reasons\u001b[39;00m\n\u001b[0;32m   1503\u001b[0m \u001b[38;5;66;03m# we need to give `na_action=\"ignore\"` for categorical data.\u001b[39;00m\n\u001b[0;32m   1504\u001b[0m \u001b[38;5;66;03m# TODO: remove the `na_action=\"ignore\"` when that default has been changed in\u001b[39;00m\n\u001b[0;32m   1505\u001b[0m \u001b[38;5;66;03m#  Categorical (GH51645).\u001b[39;00m\n\u001b[0;32m   1506\u001b[0m action \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mignore\u001b[39m\u001b[38;5;124m\"\u001b[39m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(obj\u001b[38;5;241m.\u001b[39mdtype, CategoricalDtype) \u001b[38;5;28;01melse\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n\u001b[1;32m-> 1507\u001b[0m mapped \u001b[38;5;241m=\u001b[39m \u001b[43mobj\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_map_values\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m   1508\u001b[0m \u001b[43m    \u001b[49m\u001b[43mmapper\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mcurried\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mna_action\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43maction\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconvert\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconvert_dtype\u001b[49m\n\u001b[0;32m   1509\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1511\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mlen\u001b[39m(mapped) \u001b[38;5;129;01mand\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(mapped[\u001b[38;5;241m0\u001b[39m], ABCSeries):\n\u001b[0;32m   1512\u001b[0m     \u001b[38;5;66;03m# GH#43986 Need to do list(mapped) in order to get treated as nested\u001b[39;00m\n\u001b[0;32m   1513\u001b[0m     \u001b[38;5;66;03m#  See also GH#25959 regarding EA support\u001b[39;00m\n\u001b[0;32m   1514\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m obj\u001b[38;5;241m.\u001b[39m_constructor_expanddim(\u001b[38;5;28mlist\u001b[39m(mapped), index\u001b[38;5;241m=\u001b[39mobj\u001b[38;5;241m.\u001b[39mindex)\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\pandas\\core\\base.py:921\u001b[0m, in \u001b[0;36mIndexOpsMixin._map_values\u001b[1;34m(self, mapper, na_action, convert)\u001b[0m\n\u001b[0;32m    918\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28misinstance\u001b[39m(arr, ExtensionArray):\n\u001b[0;32m    919\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m arr\u001b[38;5;241m.\u001b[39mmap(mapper, na_action\u001b[38;5;241m=\u001b[39mna_action)\n\u001b[1;32m--> 921\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43malgorithms\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mmap_array\u001b[49m\u001b[43m(\u001b[49m\u001b[43marr\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmapper\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mna_action\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mna_action\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconvert\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconvert\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\COMP\\ajai\\GraphRAG\\.venv\\Lib\\site-packages\\pandas\\core\\algorithms.py:1743\u001b[0m, in \u001b[0;36mmap_array\u001b[1;34m(arr, mapper, na_action, convert)\u001b[0m\n\u001b[0;32m   1741\u001b[0m values \u001b[38;5;241m=\u001b[39m arr\u001b[38;5;241m.\u001b[39mastype(\u001b[38;5;28mobject\u001b[39m, copy\u001b[38;5;241m=\u001b[39m\u001b[38;5;28;01mFalse\u001b[39;00m)\n\u001b[0;32m   1742\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m na_action \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[1;32m-> 1743\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mlib\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mmap_infer\u001b[49m\u001b[43m(\u001b[49m\u001b[43mvalues\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mmapper\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mconvert\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[43mconvert\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m   1744\u001b[0m \u001b[38;5;28;01melse\u001b[39;00m:\n\u001b[0;32m   1745\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m lib\u001b[38;5;241m.\u001b[39mmap_infer_mask(\n\u001b[0;32m   1746\u001b[0m         values, mapper, mask\u001b[38;5;241m=\u001b[39misna(values)\u001b[38;5;241m.\u001b[39mview(np\u001b[38;5;241m.\u001b[39muint8), convert\u001b[38;5;241m=\u001b[39mconvert\n\u001b[0;32m   1747\u001b[0m     )\n",
      "File \u001b[1;32mlib.pyx:2972\u001b[0m, in \u001b[0;36mpandas._libs.lib.map_infer\u001b[1;34m()\u001b[0m\n",
      "Cell \u001b[1;32mIn[14], line 1\u001b[0m, in \u001b[0;36m<lambda>\u001b[1;34m(q)\u001b[0m\n\u001b[1;32m----> 1\u001b[0m df[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mcypher\u001b[39m\u001b[38;5;124m'\u001b[39m] \u001b[38;5;241m=\u001b[39m df[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mquestion\u001b[39m\u001b[38;5;124m'\u001b[39m]\u001b[38;5;241m.\u001b[39mapply(\u001b[38;5;28;01mlambda\u001b[39;00m q: \u001b[43msafe_get_cypher_query\u001b[49m\u001b[43m(\u001b[49m\u001b[43mq\u001b[49m\u001b[43m)\u001b[49m)\n",
      "Cell \u001b[1;32mIn[13], line 20\u001b[0m, in \u001b[0;36msafe_get_cypher_query\u001b[1;34m(question)\u001b[0m\n\u001b[0;32m     18\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mException\u001b[39;00m \u001b[38;5;28;01mas\u001b[39;00m e:\n\u001b[0;32m     19\u001b[0m         \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;124mf\u001b[39m\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mError: \u001b[39m\u001b[38;5;132;01m{\u001b[39;00me\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m. Retrying (\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mattempt\u001b[38;5;250m \u001b[39m\u001b[38;5;241m+\u001b[39m\u001b[38;5;250m \u001b[39m\u001b[38;5;241m1\u001b[39m\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m/\u001b[39m\u001b[38;5;132;01m{\u001b[39;00mretry_count\u001b[38;5;132;01m}\u001b[39;00m\u001b[38;5;124m)...\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n\u001b[1;32m---> 20\u001b[0m         time\u001b[38;5;241m.\u001b[39msleep(\u001b[43mrandom\u001b[49m\u001b[38;5;241m.\u001b[39muniform(\u001b[38;5;241m1\u001b[39m, \u001b[38;5;241m3\u001b[39m))\n\u001b[0;32m     21\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m\n",
      "\u001b[1;31mNameError\u001b[0m: name 'random' is not defined"
     ]
    }
   ],
   "source": [
    "df['cypher'] = df['question'].apply(lambda q: safe_get_cypher_query(q))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "# df.to_excel('../processed_data/text2cypher_questions_with_cypher.xlsx',index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>type</th>\n",
       "      <th>cypher</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Which clubs have the most players with an over...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club) WHERE ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Which clubs have the most players with a value...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club), (p)-[...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which clubs have the most players with a best ...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club), (p)-[...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What is the average wage of all players with a...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player) WHERE p.best_overall &gt; 85 MAT...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which players have a best overall rating above...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player) WHERE p.best_overall &gt; 85 RET...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>213</th>\n",
       "      <td>What is the average wage of players who are pl...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position {...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>214</th>\n",
       "      <td>What is the average overall rating of players ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position)-...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>215</th>\n",
       "      <td>What is the average wage of players who are pl...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position)&lt;...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>216</th>\n",
       "      <td>Which players have a wage above 5000 and are n...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_FOR]-&gt;(c:Club) WHERE...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>217</th>\n",
       "      <td>What is the total value of all players with an...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (player:Player)-[:HAS_FINANCIALS]-&gt;(fina...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>218 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              question  \\\n",
       "0    Which clubs have the most players with an over...   \n",
       "1    Which clubs have the most players with a value...   \n",
       "2    Which clubs have the most players with a best ...   \n",
       "3    What is the average wage of all players with a...   \n",
       "4    Which players have a best overall rating above...   \n",
       "..                                                 ...   \n",
       "213  What is the average wage of players who are pl...   \n",
       "214  What is the average overall rating of players ...   \n",
       "215  What is the average wage of players who are pl...   \n",
       "216  Which players have a wage above 5000 and are n...   \n",
       "217  What is the total value of all players with an...   \n",
       "\n",
       "                           type  \\\n",
       "0    Simple Aggregation Queries   \n",
       "1    Simple Aggregation Queries   \n",
       "2    Simple Aggregation Queries   \n",
       "3    Simple Aggregation Queries   \n",
       "4    Simple Aggregation Queries   \n",
       "..                          ...   \n",
       "213   Complex Retrieval Queries   \n",
       "214   Complex Retrieval Queries   \n",
       "215   Complex Retrieval Queries   \n",
       "216   Complex Retrieval Queries   \n",
       "217  Simple Aggregation Queries   \n",
       "\n",
       "                                                cypher  \n",
       "0    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE ...  \n",
       "1    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club), (p)-[...  \n",
       "2    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club), (p)-[...  \n",
       "3    MATCH (p:Player) WHERE p.best_overall > 85 MAT...  \n",
       "4    MATCH (p:Player) WHERE p.best_overall > 85 RET...  \n",
       "..                                                 ...  \n",
       "213  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position {...  \n",
       "214  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position)-...  \n",
       "215  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position)<...  \n",
       "216  MATCH (p:Player)-[r:PLAYS_FOR]->(c:Club) WHERE...  \n",
       "217  MATCH (player:Player)-[:HAS_FINANCIALS]->(fina...  \n",
       "\n",
       "[218 rows x 3 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df=pd.read_excel(r'../processed_data/text2cypher_questions_with_cypher.xlsx')\n",
    "df"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Evaluate the generated Cypher query by running it against the database. Check if it has any syntax errors, times out, or returns a result."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'nan': expected 'FOREACH', 'ALTER', 'ORDER BY', 'CALL', 'USING PERIODIC COMMIT', 'CREATE', 'LOAD CSV', 'START DATABASE', 'STOP DATABASE', 'DEALLOCATE', 'DELETE', 'DENY', 'DETACH', 'DROP', 'DRYRUN', 'FINISH', 'GRANT', 'INSERT', 'LIMIT', 'MATCH', 'MERGE', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REALLOCATE', 'REMOVE', 'RENAME', 'RETURN', 'REVOKE', 'ENABLE SERVER', 'SET', 'SHOW', 'SKIP', 'TERMINATE', 'UNWIND', 'USE' or 'WITH' (line 1, column 1 (offset: 0))\n",
      "\"nan\"\n",
      " ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: A pattern expression should only be used in order to test the existence of a pattern. It can no longer be used inside the function size(), an alternative is to replace size() with COUNT {}. (line 1, column 176 (offset: 175))\n",
      "\"MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:PLAYS_AS]->(pos:Position)<-[:HAS_PERFORMANCE]-(perf:Performance) WHERE perf.overall_rating > 75 AND pos.name = 'Goalkeeper' AND size((c)-[:PLAYS_FOR]->(p)) > 2 RETURN c.name AS name\"\n",
      "                                                                                                                                                                                ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'max': expected an expression (line 1, column 46 (offset: 45))\n",
      "\"MATCH (p:Player) WHERE p.potential = (SELECT max(p2.potential) FROM (p:Player)) AND p.overall_rating = (SELECT max(p2.overall_rating) FROM (p:Player)) RETURN p.name\"\n",
      "                                              ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'GROUP': expected a graph pattern, 'FOREACH', ',', 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FINISH', 'INSERT', 'LIMIT', 'MATCH', 'MERGE', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SET', 'SKIP', 'UNION', 'UNWIND', 'USE', 'USING', 'WHERE', 'WITH' or <EOF> (line 1, column 115 (offset: 114))\n",
      "\"MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials) WHERE f.value > 10000000 MATCH (p)-[:PLAYS_AS]->(pos:Position) GROUP BY pos RETURN pos.name AS position, COUNT(p) AS count ORDER BY count DESC\"\n",
      "                                                                                                                   ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'MAX': expected an expression (line 1, column 124 (offset: 123))\n",
      "\"MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financials)-[:HAS_PERFORMANCE]->(perf:Performance) WHERE f.release_clause = (SELECT MAX(f2.release_clause) FROM (p:Player)-[:HAS_FINANCIALS]->(f2:Financials)) AND perf.overall_rating = (SELECT MAX(perf2.overall_rating) FROM (p:Player)-[:HAS_PERFORMANCE]->(perf2:Performance)) RETURN p.name\"\n",
      "                                                                                                                            ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Variable `financials` not defined (line 1, column 96 (offset: 95))\n",
      "\"MATCH (p:Player)-[:PLAYS_AS]->(:Position {name: 'Left winger'})-[:PLAYS_FOR]->(c:Club) WHERE p(financials.value) > 8500000 RETURN p\"\n",
      "                                                                                                ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '{': expected an identifier or '}' (line 1, column 46 (offset: 45))\n",
      "\"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {{ name: 'Forward' }}) WHERE p.release_clause > 2000000 RETURN p\"\n",
      "                                              ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '{': expected an identifier or '}' (line 1, column 46 (offset: 45))\n",
      "\"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {{name: 'CAM'}})-[:HAS_PERFORMANCE]->(perf:Performance) RETURN avg(p.wage) AS average_wage\"\n",
      "                                              ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'GROUP': expected an expression, 'FOREACH', 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FINISH', 'INSERT', 'LIMIT', 'MATCH', 'MERGE', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SET', 'SKIP', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF> (line 1, column 69 (offset: 68))\n",
      "\"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position) WHERE p.potential > 90 GROUP BY pos.name ORDER BY COUNT(p) DESC LIMIT 10 RETURN pos.name AS position, COUNT(p) AS count\"\n",
      "                                                                     ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_FOOT)} {position: line: 1, column: 48, offset: 47} for query: \"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[:HAS_FOOT]->(foot:Foot {type:'Right'})-[:HAS_FINANCIALS]->(fin:Financials) WHERE p.fin.value > 8500000 RETURN p\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: fin)} {position: line: 1, column: 130, offset: 129} for query: \"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[:HAS_FOOT]->(foot:Foot {type:'Right'})-[:HAS_FINANCIALS]->(fin:Financials) WHERE p.fin.value > 8500000 RETURN p\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: performance)} {position: line: 1, column: 138, offset: 137} for query: \"MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[:USES_FOOT]->(foot:Foot) WHERE p.overall_rating > 80 AND pos.name = 'Right defender' AND p.performance.overall_rating > 85 RETURN p\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: HAS_AGE_GROUP)} {position: line: 1, column: 53, offset: 52} for query: \"MATCH (p:Player)-[:PLAYS_AS]->(position:Position)-[:HAS_AGE_GROUP]->(agegroup:AgeGroup) WHERE p.potential > 90 AND agegroup.name = 'Veteran' RETURN p.name\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: age_group)} {position: line: 1, column: 164, offset: 163} for query: \"MATCH (p:Player)-[:PLAYS_AS]->(position:Position)-[:HAS_ROLE]->(role:Role)-[:HAS_PERFORMANCE]->(performance:Performance) WHERE p.best_overall > 85 AND performance.age_group.name = 'Veteran' RETURN p.name\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: IS_IN_AGE_GROUP)} {position: line: 1, column: 90, offset: 89} for query: \"MATCH (p:Player)-[:PLAYS_FOR]->() WHERE p.release_clause > 8300000 AND NOT exists{ (p)-[:IS_IN_AGE_GROUP]->(:AgeGroup {name: 'Young Adult'})} RETURN p\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Query cannot conclude with MATCH (must be a RETURN clause, a FINISH clause, an update clause, a unit subquery call, or a procedure call with no YIELD). (line 1, column 1 (offset: 0))\n",
      "\"MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)\"\n",
      " ^}\n",
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Query cannot conclude with MATCH (must be a RETURN clause, a FINISH clause, an update clause, a unit subquery call, or a procedure call with no YIELD). (line 1, column 1 (offset: 0))\n",
      "\"MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)\"\n",
      " ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: AGE_GROUP)} {position: line: 1, column: 89, offset: 88} for query: \"MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE p.release_clause > 12300000 AND NOT (p)-[:AGE_GROUP]->(:AgeGroup {name: 'Young Adult'}) RETURN p\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: age_group)} {position: line: 1, column: 177, offset: 176} for query: \"MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)-[:PLAYS_AS]->(pos:Position)-[:HAS_ROLE]->(role:Role)-[:HAS_PERFORMANCE]->(perf:Performance)-[:HAS_FINANCIALS]->(fin:Financials) WHERE p.age_group = 'Teenager' RETURN avg(fin.wage) AS average_wage\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Unexpected error: {code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input '{': expected an expression, 'FOREACH', 'ORDER BY', 'CALL', 'CREATE', 'LOAD CSV', 'DELETE', 'DETACH', 'FINISH', 'INSERT', 'LIMIT', 'MATCH', 'MERGE', 'NODETACH', 'OFFSET', 'OPTIONAL', 'REMOVE', 'RETURN', 'SET', 'SKIP', 'UNION', 'UNWIND', 'USE', 'WITH' or <EOF> (line 1, column 189 (offset: 188))\n",
      "\"MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)-[:PLAYS_AS]->(pos:Position)-[:HAS_ROLE]->(role:Role)-[:HAS_PERFORMANCE]->(perf:Performance)-[:HAS_FINANCIALS]->(fin:Financials) WHERE p.age:AgeGroup{name:'Prime'} AND fin.value > 1.5E8 RETURN p\"\n",
      "                                                                                                                                                                                             ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownRelationshipTypeWarning} {category: UNRECOGNIZED} {title: The provided relationship type is not in the database.} {description: One of the relationship types in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing relationship type is: PLAYS_IN)} {position: line: 1, column: 20, offset: 19} for query: \"MATCH (p:Player)-[:PLAYS_IN {age_group: 'Veteran'}]->() WITH avg(p.overall_rating) as average_rating RETURN average_rating\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: age_group)} {position: line: 1, column: 30, offset: 29} for query: \"MATCH (p:Player)-[:PLAYS_IN {age_group: 'Veteran'}]->() WITH avg(p.overall_rating) as average_rating RETURN average_rating\"\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>type</th>\n",
       "      <th>cypher</th>\n",
       "      <th>query_result</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout_error</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Which clubs have the most players with an over...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club) WHERE ...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Which clubs have the most players with a value...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club), (p)-[...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which clubs have the most players with a best ...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club), (p)-[...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>What is the average wage of all players with a...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player) WHERE p.best_overall &gt; 85 MAT...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which players have a best overall rating above...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player) WHERE p.best_overall &gt; 85 RET...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>213</th>\n",
       "      <td>What is the average wage of players who are pl...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position {...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>214</th>\n",
       "      <td>What is the average overall rating of players ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position)-...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>215</th>\n",
       "      <td>What is the average wage of players who are pl...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_AS]-&gt;(pos:Position)&lt;...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>216</th>\n",
       "      <td>Which players have a wage above 5000 and are n...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[r:PLAYS_FOR]-&gt;(c:Club) WHERE...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>217</th>\n",
       "      <td>What is the total value of all players with an...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (player:Player)-[:HAS_FINANCIALS]-&gt;(fina...</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>218 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              question  \\\n",
       "0    Which clubs have the most players with an over...   \n",
       "1    Which clubs have the most players with a value...   \n",
       "2    Which clubs have the most players with a best ...   \n",
       "3    What is the average wage of all players with a...   \n",
       "4    Which players have a best overall rating above...   \n",
       "..                                                 ...   \n",
       "213  What is the average wage of players who are pl...   \n",
       "214  What is the average overall rating of players ...   \n",
       "215  What is the average wage of players who are pl...   \n",
       "216  Which players have a wage above 5000 and are n...   \n",
       "217  What is the total value of all players with an...   \n",
       "\n",
       "                           type  \\\n",
       "0    Simple Aggregation Queries   \n",
       "1    Simple Aggregation Queries   \n",
       "2    Simple Aggregation Queries   \n",
       "3    Simple Aggregation Queries   \n",
       "4    Simple Aggregation Queries   \n",
       "..                          ...   \n",
       "213   Complex Retrieval Queries   \n",
       "214   Complex Retrieval Queries   \n",
       "215   Complex Retrieval Queries   \n",
       "216   Complex Retrieval Queries   \n",
       "217  Simple Aggregation Queries   \n",
       "\n",
       "                                                cypher  query_result  \\\n",
       "0    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE ...          True   \n",
       "1    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club), (p)-[...          True   \n",
       "2    MATCH (p:Player)-[:PLAYS_FOR]->(c:Club), (p)-[...          True   \n",
       "3    MATCH (p:Player) WHERE p.best_overall > 85 MAT...          True   \n",
       "4    MATCH (p:Player) WHERE p.best_overall > 85 RET...          True   \n",
       "..                                                 ...           ...   \n",
       "213  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position {...          True   \n",
       "214  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position)-...          True   \n",
       "215  MATCH (p:Player)-[r:PLAYS_AS]->(pos:Position)<...          True   \n",
       "216  MATCH (p:Player)-[r:PLAYS_FOR]->(c:Club) WHERE...          True   \n",
       "217  MATCH (player:Player)-[:HAS_FINANCIALS]->(fina...          True   \n",
       "\n",
       "     syntax_error  timeout_error  \n",
       "0           False          False  \n",
       "1           False          False  \n",
       "2           False          False  \n",
       "3           False          False  \n",
       "4           False          False  \n",
       "..            ...            ...  \n",
       "213         False          False  \n",
       "214         False          False  \n",
       "215         False          False  \n",
       "216         False          False  \n",
       "217         False          False  \n",
       "\n",
       "[218 rows x 6 columns]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph = Neo4jGraph(url=neo4j_url, username=neo4j_user, password=neo4j_password, sanitize=True, enhanced_schema=True)\n",
    "\n",
    "# Define the function to execute the query and handle errors\n",
    "def execute_query(row):\n",
    "    try:\n",
    "        # Execute the Cypher query from the 'cypher' column\n",
    "        data = graph.query(row[\"cypher\"])\n",
    "        \n",
    "        # Check if the query returned data\n",
    "        if data:\n",
    "            return pd.Series([True, False, False])  # returns_results, syntax_error, timeout_error\n",
    "        else:\n",
    "            return pd.Series([False, False, False])  # No results, no error, no timeout\n",
    "    \n",
    "    except ValueError as e:\n",
    "        # Handle invalid Cypher query errors\n",
    "        if \"Generated Cypher Statement is not valid\" in str(e):\n",
    "            print(f\"Syntax error in Cypher query: {e}\")\n",
    "            return pd.Series([False, True, False])  # False for results, True for syntax error, no timeout\n",
    "        else:\n",
    "            print(f\"Other ValueError: {e}\")\n",
    "            return pd.Series([False, False, False])  # False for results, no error, no timeout\n",
    "    \n",
    "    except Exception as e:\n",
    "        # Handle timeout errors\n",
    "        if hasattr(e, 'code') and e.code == \"Neo.ClientError.Transaction.TransactionTimedOutClientConfiguration\":\n",
    "            return pd.Series([False, False, True])  # False for results, no syntax error, True for timeout\n",
    "        else:\n",
    "            # Handle other exceptions\n",
    "            print(f\"Unexpected error: {e}\")\n",
    "            return pd.Series([False, False, False])  # False for results, no error, no timeout\n",
    "\n",
    "# Apply the function to the 'cypher' column and unpack the returned Series into new columns\n",
    "df[['query_result', 'syntax_error', 'timeout_error']] = df.apply(execute_query, axis=1)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "type\n",
       "Simple Aggregation Queries    106\n",
       "Complex Retrieval Queries      35\n",
       "Simple Retrieval Queries       23\n",
       "Name: count, dtype: int64"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[df['query_result']==True]['type'].value_counts()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>type</th>\n",
       "      <th>cypher</th>\n",
       "      <th>query_result</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout_error</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Which clubs have the most players with a finan...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (c:Club)-[:PLAYS_FOR]-&gt;(p:Player)-[:HAS_...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Which clubs have more than 3 players with a be...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>NaN</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which clubs have more than 2 players with a ov...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (c:Club)&lt;-[:PLAYS_FOR]-(p:Player)-[:HAS_...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Which clubs have more than 2 players with a ov...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (c:Club)-[:PLAYS_FOR]-&gt;(p:Player)-[:PLAY...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which clubs have more than 2 players with a ov...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (c:Club)-[:PLAYS_FOR]-&gt;(p:Player)-[:PLAY...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>What are the names of all players who have a o...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:HAS_ROLE]-&gt;(ageGroup:AgeGro...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>What is the name of the player with the highes...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player) WHERE p.potential = (SELECT m...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Which positions have the most players with a v...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:HAS_FINANCIALS]-&gt;(f:Financi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>What is the name of the player with the highes...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:HAS_FINANCIALS]-&gt;(f:Financi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Which players have a financial value above 3.5...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:HAS_FINANCIALS]-&gt;(f:Financi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Which players have a financial value above 850...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(:Position {name...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Which players have a financial value above 1.8...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(:Position {name...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Which players have a financial value above 850...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(:Position {name...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Which players have a wage above 250000 and pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(:Position {name...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Which players have a release clause above 2000...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {{...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>What is the average wage of all players who ha...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {{...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Which players have a release clause value abov...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Which players have a financial value above 3.5...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Which players have a financial value above 850...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Which players have a value above 5000000 and p...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Which players have a release clause above 1500...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Which players have a potential rating above 90...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Which players have a release clause above 3000...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position {n...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Which positions have the most players with a p...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position) W...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Which players have a release clause above 2500...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position) W...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Which players have a financial value above 850...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Which players have a potential rating above 90...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>What are the names of all players who play as ...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Which players have a potential rating above 90...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)-[...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Which positions have the most players with a p...</td>\n",
       "      <td>Simple Aggregation Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(pos:Position)&lt;-...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>What are the names of all players who play as ...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>Which players have a release clause value abov...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>What are the names of all players who have a p...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>What are the names of all players who have a b...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>What are the names of all players who play as ...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>Which players have a wage above 300000 and pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_AS]-&gt;(position:Positi...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>What are the names of all players who have pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club {name: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>What are the names of all players who have pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club {name: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>What are the names of all players who have pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club {name: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>What are the names of all players who have a o...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club)</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>Which players have a financial value above 1.8...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club)</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>Which players have an overall rating above 80 ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club) WHERE ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>Which players have a financial value above 1.5...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club)-[:PLAY...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>What is the name of the player with the highes...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club)-[:USES...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>What are the names of all players who have pla...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:PLAYS_FOR]-&gt;(c:Club)&lt;-[:PLA...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>Which players have a performance rating above ...</td>\n",
       "      <td>Complex Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:USES_FOOT]-&gt;(f:Foot {type: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>What are the names of all players who play as ...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:USES_FOOT]-&gt;(f:Foot {type: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>Which players have a value above 4000000 and p...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>MATCH (p:Player)-[:USES_FOOT]-&gt;(f:Foot {type: ...</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                             question  \\\n",
       "0   Which clubs have the most players with a finan...   \n",
       "1   Which clubs have more than 3 players with a be...   \n",
       "2   Which clubs have more than 2 players with a ov...   \n",
       "3   Which clubs have more than 2 players with a ov...   \n",
       "4   Which clubs have more than 2 players with a ov...   \n",
       "5   What are the names of all players who have a o...   \n",
       "6   What is the name of the player with the highes...   \n",
       "7   Which positions have the most players with a v...   \n",
       "8   What is the name of the player with the highes...   \n",
       "9   Which players have a financial value above 3.5...   \n",
       "10  Which players have a financial value above 850...   \n",
       "11  Which players have a financial value above 1.8...   \n",
       "12  Which players have a financial value above 850...   \n",
       "13  Which players have a wage above 250000 and pla...   \n",
       "14  Which players have a release clause above 2000...   \n",
       "15  What is the average wage of all players who ha...   \n",
       "16  Which players have a release clause value abov...   \n",
       "17  Which players have a financial value above 3.5...   \n",
       "18  Which players have a financial value above 850...   \n",
       "19  Which players have a value above 5000000 and p...   \n",
       "20  Which players have a release clause above 1500...   \n",
       "21  Which players have a potential rating above 90...   \n",
       "22  Which players have a release clause above 3000...   \n",
       "23  Which players have a performance rating above ...   \n",
       "24  Which positions have the most players with a p...   \n",
       "25  Which players have a release clause above 2500...   \n",
       "26  Which players have a financial value above 850...   \n",
       "27  Which players have a performance rating above ...   \n",
       "28  Which players have a potential rating above 90...   \n",
       "29  Which players have a performance rating above ...   \n",
       "30  What are the names of all players who play as ...   \n",
       "31  Which players have a potential rating above 90...   \n",
       "32  Which players have a performance rating above ...   \n",
       "33  Which players have a performance rating above ...   \n",
       "34  Which positions have the most players with a p...   \n",
       "35  What are the names of all players who play as ...   \n",
       "36  Which players have a release clause value abov...   \n",
       "37  Which players have a performance rating above ...   \n",
       "38  What are the names of all players who have a p...   \n",
       "39  What are the names of all players who have a b...   \n",
       "40  What are the names of all players who play as ...   \n",
       "41  Which players have a wage above 300000 and pla...   \n",
       "42  What are the names of all players who have pla...   \n",
       "43  What are the names of all players who have pla...   \n",
       "44  What are the names of all players who have pla...   \n",
       "45  What are the names of all players who have a o...   \n",
       "46  Which players have a financial value above 1.8...   \n",
       "47  Which players have an overall rating above 80 ...   \n",
       "48  Which players have a financial value above 1.5...   \n",
       "49  What is the name of the player with the highes...   \n",
       "50  What are the names of all players who have pla...   \n",
       "51  Which players have a performance rating above ...   \n",
       "52  What are the names of all players who play as ...   \n",
       "53  Which players have a value above 4000000 and p...   \n",
       "\n",
       "                          type  \\\n",
       "0   Simple Aggregation Queries   \n",
       "1     Simple Retrieval Queries   \n",
       "2     Simple Retrieval Queries   \n",
       "3     Simple Retrieval Queries   \n",
       "4     Simple Retrieval Queries   \n",
       "5     Simple Retrieval Queries   \n",
       "6    Complex Retrieval Queries   \n",
       "7   Simple Aggregation Queries   \n",
       "8    Complex Retrieval Queries   \n",
       "9    Complex Retrieval Queries   \n",
       "10   Complex Retrieval Queries   \n",
       "11   Complex Retrieval Queries   \n",
       "12   Complex Retrieval Queries   \n",
       "13    Simple Retrieval Queries   \n",
       "14    Simple Retrieval Queries   \n",
       "15    Simple Retrieval Queries   \n",
       "16   Complex Retrieval Queries   \n",
       "17   Complex Retrieval Queries   \n",
       "18   Complex Retrieval Queries   \n",
       "19    Simple Retrieval Queries   \n",
       "20    Simple Retrieval Queries   \n",
       "21   Complex Retrieval Queries   \n",
       "22    Simple Retrieval Queries   \n",
       "23   Complex Retrieval Queries   \n",
       "24  Simple Aggregation Queries   \n",
       "25    Simple Retrieval Queries   \n",
       "26   Complex Retrieval Queries   \n",
       "27   Complex Retrieval Queries   \n",
       "28   Complex Retrieval Queries   \n",
       "29   Complex Retrieval Queries   \n",
       "30    Simple Retrieval Queries   \n",
       "31   Complex Retrieval Queries   \n",
       "32   Complex Retrieval Queries   \n",
       "33   Complex Retrieval Queries   \n",
       "34  Simple Aggregation Queries   \n",
       "35    Simple Retrieval Queries   \n",
       "36   Complex Retrieval Queries   \n",
       "37   Complex Retrieval Queries   \n",
       "38    Simple Retrieval Queries   \n",
       "39    Simple Retrieval Queries   \n",
       "40    Simple Retrieval Queries   \n",
       "41    Simple Retrieval Queries   \n",
       "42    Simple Retrieval Queries   \n",
       "43    Simple Retrieval Queries   \n",
       "44    Simple Retrieval Queries   \n",
       "45    Simple Retrieval Queries   \n",
       "46   Complex Retrieval Queries   \n",
       "47   Complex Retrieval Queries   \n",
       "48   Complex Retrieval Queries   \n",
       "49   Complex Retrieval Queries   \n",
       "50    Simple Retrieval Queries   \n",
       "51   Complex Retrieval Queries   \n",
       "52    Simple Retrieval Queries   \n",
       "53    Simple Retrieval Queries   \n",
       "\n",
       "                                               cypher  query_result  \\\n",
       "0   MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:HAS_...         False   \n",
       "1                                                 NaN         False   \n",
       "2   MATCH (c:Club)<-[:PLAYS_FOR]-(p:Player)-[:HAS_...         False   \n",
       "3   MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:PLAY...         False   \n",
       "4   MATCH (c:Club)-[:PLAYS_FOR]->(p:Player)-[:PLAY...         False   \n",
       "5   MATCH (p:Player)-[:HAS_ROLE]->(ageGroup:AgeGro...         False   \n",
       "6   MATCH (p:Player) WHERE p.potential = (SELECT m...         False   \n",
       "7   MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financi...         False   \n",
       "8   MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financi...         False   \n",
       "9   MATCH (p:Player)-[:HAS_FINANCIALS]->(f:Financi...         False   \n",
       "10  MATCH (p:Player)-[:PLAYS_AS]->(:Position {name...         False   \n",
       "11  MATCH (p:Player)-[:PLAYS_AS]->(:Position {name...         False   \n",
       "12  MATCH (p:Player)-[:PLAYS_AS]->(:Position {name...         False   \n",
       "13  MATCH (p:Player)-[:PLAYS_AS]->(:Position {name...         False   \n",
       "14  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {{...         False   \n",
       "15  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {{...         False   \n",
       "16  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "17  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "18  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "19  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "20  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "21  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "22  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "23  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position {n...         False   \n",
       "24  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position) W...         False   \n",
       "25  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position) W...         False   \n",
       "26  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "27  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "28  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "29  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "30  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "31  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "32  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "33  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)-[...         False   \n",
       "34  MATCH (p:Player)-[:PLAYS_AS]->(pos:Position)<-...         False   \n",
       "35  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "36  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "37  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "38  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "39  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "40  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "41  MATCH (p:Player)-[:PLAYS_AS]->(position:Positi...         False   \n",
       "42  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: ...         False   \n",
       "43  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: ...         False   \n",
       "44  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club {name: ...         False   \n",
       "45            MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)         False   \n",
       "46            MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)         False   \n",
       "47  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club) WHERE ...         False   \n",
       "48  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)-[:PLAY...         False   \n",
       "49  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)-[:USES...         False   \n",
       "50  MATCH (p:Player)-[:PLAYS_FOR]->(c:Club)<-[:PLA...         False   \n",
       "51  MATCH (p:Player)-[:USES_FOOT]->(f:Foot {type: ...         False   \n",
       "52  MATCH (p:Player)-[:USES_FOOT]->(f:Foot {type: ...         False   \n",
       "53  MATCH (p:Player)-[:USES_FOOT]->(f:Foot {type: ...         False   \n",
       "\n",
       "    syntax_error  timeout_error  \n",
       "0          False          False  \n",
       "1          False          False  \n",
       "2          False          False  \n",
       "3          False          False  \n",
       "4          False          False  \n",
       "5          False          False  \n",
       "6          False          False  \n",
       "7          False          False  \n",
       "8          False          False  \n",
       "9          False          False  \n",
       "10         False          False  \n",
       "11         False          False  \n",
       "12         False          False  \n",
       "13         False          False  \n",
       "14         False          False  \n",
       "15         False          False  \n",
       "16         False          False  \n",
       "17         False          False  \n",
       "18         False          False  \n",
       "19         False          False  \n",
       "20         False          False  \n",
       "21         False          False  \n",
       "22         False          False  \n",
       "23         False          False  \n",
       "24         False          False  \n",
       "25         False          False  \n",
       "26         False          False  \n",
       "27         False          False  \n",
       "28         False          False  \n",
       "29         False          False  \n",
       "30         False          False  \n",
       "31         False          False  \n",
       "32         False          False  \n",
       "33         False          False  \n",
       "34         False          False  \n",
       "35         False          False  \n",
       "36         False          False  \n",
       "37         False          False  \n",
       "38         False          False  \n",
       "39         False          False  \n",
       "40         False          False  \n",
       "41         False          False  \n",
       "42         False          False  \n",
       "43         False          False  \n",
       "44         False          False  \n",
       "45         False          False  \n",
       "46         False          False  \n",
       "47         False          False  \n",
       "48         False          False  \n",
       "49         False          False  \n",
       "50         False          False  \n",
       "51         False          False  \n",
       "52         False          False  \n",
       "53         False          False  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df[df['query_result']==False].reset_index(drop=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "df.to_excel('text2cypher_questions_with_cypher_validated.xlsx',index=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".venv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
